{
  "documents": [
    {
      "page_content": "25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nThe Constitution of the People‍’s Republic of Bangladesh\n( ACT NO. OF 1972 )\n\n1[BISMILLAH-AR-RAHMAN-AR-RAHIM\n\n(In the name of Allah, the Beneficient, the Merciful)/\nIn the name of the Creator, the Merciful.]\nPREAMBLE\nWe, the people of Bangladesh, having proclaimed our independence on the 26th day of\nMarch, 1971 and through 2[a historic struggle for national liberation], established the\nindependent, sovereign People's Republic of Bangladesh;\n3[Pledging that the high ideals of nationalism, socialism, democracy and secularism, which\n\ninspired our heroic people to dedicate themselves to, and our brave martyrs to sacrifice their\nlives in, the national liberation struggle, shall be the fundamental principles of the\nConstitution;]\nFurther pledging that it shall be a fundamental aim of the State to realise through the\ndemocratic process a socialist society, free from exploitation a society in which the rule of\nlaw, fundamental human rights and freedom, equality and justice, political, economic and\nsocial, will be secured for all citizens;\nAffirming that it is our sacred duty to safeguard, protect and defend this Constitution and to\nmaintain its supremacy as the embodiment of the will of the people of Bangladesh so that\nwe may prosper in freedom and may make our full contribution towards international peace\nand co operation in keeping with the progressive aspirations of mankind;\nIn our Constituent Assembly, this eighteenth day of Kartick, 1379 B.S., corresponding to the\nfourth day of November, 1972 A.D., do hereby adopt, enact and give to ourselves this\nConstitution.\n\nPART I\nTHE REPUBLIC\nThe\nRepublic\n\n1. Bangladesh is a unitary, independent, sovereign Republic to be known\nas the People's Republic of Bangladesh.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nThe\nterritory of\nthe\nRepublic\n\n2. The territory of the Republic shall comprise –\n(a) the territories which immediately before the Proclamation of\nIndependence on the 26th day of March, 1971 constituted East Pakistan\n4[and\n\nthe territories referred to as included territories in the Constitution\n\n(Third Amendment) Act, 1974, but excluding the territories referred to as\nexcluded territories in that Act; and]\n(b) such other territories as may become included in Bangladesh.\nThe state\nreligion\n\n5[2A. The state religion of the Republic is Islam, but the State shall ensure equal status and equal right in the practice of the Hindu, Buddhist, Christian and other religions.]\n\nThe state language\n\n3. The state language of the Republic is 6[Bangla].\n\nNational anthem, flag and emblem\n\n4. (1) The national anthem of the Republic is the first ten lines of “Amar Sonar Bangla”.\n(2) The national flag of the Republic shall consist of a circle, coloured red throughout its area, resting on a green background.\n(3) The national emblem of the Republic is the national flower Shapla\n(nymphaea nouchali) resting on water, having on each side an ear of\npaddy and being surmounted by three connected leaves of jute with two\nstars on each side of the leaves.\n(4) Subject to the foregoing clauses, provisions relating to the national\nanthem, flag and emblem shall be made by law.\n\nPortrait of\nthe Father\nof the\nNation\n\n7[4A.\n\nThe Portrait of the Father of the Nation, Bangabandhu Sheikh\n\nMujibur Rahman shall be preserved and displayed at the offices of the\nPresident, the Prime Minister, the Speaker and the Chief Justice and in\nhead and branch offices of all government and semi-government offices,\nautonomous bodies, statutory public authorities, government and nongovernment\n\neducational\n\nBangladesh abroad.]\n\ninstitutions,\n\nembassies\n\nand\n\nmissions\n\nof\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nThe capital\n\n5. (1) The capital of the Republic is 8[Dhaka].\n(2) The boundaries of the capital shall be determined by law.\n\nCitizenship\n\n9[6. The citizenship of Bangladesh shall be determined and regulated by\n\nlaw.\n(2) The people of Bangladesh shall be known as Bangalees as a nation\nand the citizens of Bangladesh shall be known as Bangladeshies.]\nSupremacy\nof the\nConstitution\n\n7. (1) All powers in the Republic belong to the people, and their exercise\non behalf of the people shall be effected only under, and by the authority\nof, this Constitution.\n(2) This Constitution is, as the solemn expression of the will of the people,\nthe supreme law of the Republic, and if any other law is inconsistent with\nthis Constitution that other law shall, to the extent of the inconsistency, be\nvoid.\n\nOffence of\nabrogation,\nsuspension,\netc . of the\nConstitution\n\n10[7A. (1) If any person, by show of force or use of force or by any other\n\nun-constitutional means(a) abrogates, repeals or suspends or attempts or conspires to abrogate,\nrepeal or suspend this Constitution or any of its article ; or\n(b) subverts or attempts or conspires to subvert the confidence, belief or\nreliance of the citizens to this Constitution or any of its article,\nhis such act shall be sedition and such person shall be guilty of sedition.\n(2) If any person(a) abets or instigates any act mentioned in clause (1) ; or\n(b) approves, condones, supports or ratifies such act,\nhis such act shall also be the same offence.\n(3) Any person alleged to have committed the offence mentioned in this\narticle shall be sentenced with the highest punishment prescribed for other\noffences by the existing laws.\n\nBasic\nprovisions\n\n25/04/2022\n\nof the\nConstitution\nare not\namendable\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n7B. Notwithstanding anything contained in article 142 of the Constitution,\nthe preamble, all articles of Part I, all articles of Part II, subject to the\nprovisions of Part IXA all articles of Part III, and the provisions of articles\nrelating to the basic structures of the Constitution including article 150 of\nPart XI shall not be amendable by way of insertion, modification,\nsubstitution, repeal or by any other means.]\n\nPART II\nFUNDAMENTAL PRINCIPLES OF STATE POLICY\nFundamental\nprinciples\n\n8.\n\n11[(1)\n\nThe principles of nationalism, socialism, democracy and\n\nsecularism, together with the principles derived from those as set out in\nthis Part, shall constitute the fundamental principles of state policy.]\n(2) The principles set out in this Part shall be fundamental to the\ngovernance of Bangladesh, shall be applied by the State in the making of\nlaws, shall be a guide to the interpretation of the Constitution and of the\nother laws of Bangladesh, and shall form the basis of the work of the State\nand of its citizens, but shall not be judicially enforceable.\n\nNationalism\n\n12[9.\n\nThe unity and solidarity of the Bangalee nation, which, deriving its\n\nidentity from its language and culture, attained sovereign and independent\nBangladesh through a united and determined struggle in the war of\nindependence, shall be the basis of Bangalee nationalism.]\nSocialism\nand\nfreedom\nfrom\nexploitation\n\n13[10.\n\nDemocracy\nand human\nrights\n\n11. The Republic shall be a democracy in which fundamental human rights\n\nA socialist economic system shall be established with a view to\n\nensuring the attainment of a just and egalitarian society, free from the\nexploitation of man by man.]\n\nand freedoms and respect for the dignity and worth of the human person\nshall be guaranteed 14[* * *] 15[, and in which effective participation by the\npeople through their elected representatives in administration at all levels\nshall be ensured].\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nSecularism\nand\nfreedom of\nreligion\n\n16[12. The principle of secularism shall be realised by the elimination of -\n\n(a) communalism in all its forms ;\n(b) the granting by the State of political status in favour of any religion ;\n(c) the abuse of religion for political purposes ;\n(d) any discrimination against, or persecution of, persons practicing a\nparticular religion.]\n\nPrinciples\nof\nownership\n\n13. The people shall own or control the instruments and means of\nproduction and distribution, and with this end in view ownership shall\nassume the following forms –\n(a) state ownership, that is ownership by the State on behalf of the people\nthrough the creation of an efficient and dynamic nationalised public sector\nembracing the key sectors of the economy;\n(b) co operative ownership, that is ownership by co operatives on behalf of\ntheir members within such limits as may be prescribed by law; and\n(c) private ownership, that is ownership by individuals within such limits as\nmay be prescribed by law.\n\nEmancipation\nof peasants\nand\nworkers\nProvision of\nbasic\nnecessities\n\n14. It shall be a fundamental responsibility of the State to emancipate the\ntoiling masses the peasants and workers and backward sections of the\npeople from all forms of exploitation.\n\n15. It shall be a fundamental responsibility of the State to attain, through\nplanned economic growth, a constant increase of productive forces and a\nsteady improvement in the material and cultural standard of living of the\npeople, with a view to securing to its citizens –\n(a) the provision of the basic necessities of life, including food, clothing,\nshelter, education and medical care;\n(b) the right to work, that is the right to guaranteed employment at a\nreasonable wage having regard to the quantity and quality of work;\n(c) the right to reasonable rest, recreation and leisure; and\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(d) the right to social security, that is to say, to public assistance in cases\nof undeserved want arising from unemployment, illness or disablement, or\nsuffered by widows or orphans or in old age, or in other such cases.\nRural\ndevelopment\nand\nagricultural\nrevolution\n\n16. The State shall adopt effective measures to bring about a radical\ntransformation in the rural areas through the promotion of an agricultural\nrevolution, the provision of rural electrification, the development of cottage\nand other industries, and the improvement of education, communications\nand public health, in those areas, so as progressively to remove the\ndisparity in the standards of living between the urban and the rural areas.\n\nFree and\ncompulsory\neducation\n\n17. The State shall adopt effective measures for the purpose of –\n(a) establishing a uniform, mass oriented and universal system of\neducation and extending free and compulsory education to all children to\nsuch stage as may be determined by law;\n(b) relating education to the needs of society and producing properly\ntrained and motivated citizens to serve those needs;\n(c) removing illiteracy within such time as may be determined by law.\n\nPublic\nhealth and\nmorality\n\n18. (1) The State shall regard the raising of the level of nutrition and the\nimprovement of public health as among its primary duties, and in particular\nshall adopt effective measures to prevent the consumption, except for\nmedical purposes or for such other purposes as may be prescribed by law,\nof alcoholic and other intoxicating drinks and of drugs which are injurious\nto health.\n(2) The State shall adopt effective measures to prevent prostitution and\ngambling.\n\nProtection\nand\nimprovement\nof\nenvironment\nand\nbiodiversity\n\n17[18A. The State shall endeavour to protect and improve the environment\n\nand to preserve and safeguard the natural resources, bio-diversity,\nwetlands, forests and wild life for the present and future citizens.]\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nEquality of\nopportunity\n\n19. (1) The State shall endeavour to ensure equality of opportunity to all\ncitizens.\n(2) The State shall adopt effective measures to remove social and\neconomic inequality between man and man and to ensure the equitable\ndistribution of wealth among citizens, and of opportunities in order to attain\na uniform level of economic development throughout the Republic.\n18[(3)The\n\nState Shall endeavour to ensure equality of opportunity and\n\nparticipation of women in all spheres of national life.]\nWork as a\nright and\nduty\n\n20. (1) Work is a right, a duty and a matter of honour for every citizen who\nis capable of working, and everyone shall be paid for his work on the basis\nof the principle “from each according to his abilities, to each according to\nhis work”.\n(2) The State shall endeavour to create conditions in which, as a general\nprinciple, persons shall not be able to enjoy unearned incomes, and in\nwhich human labour in every form, intellectual and physical, shall become\na fuller expression of creative endeavour and of the human personality.\n\nDuties of\ncitizens and\nof public\nservants\n\n21. (1) It is the duty of every citizen to observe the Constitution and the\nlaws, to maintain discipline, to perform public duties and to protect public\nproperty.\n(2) Every person in the service of the Republic has a duty to strive at all\ntimes to serve the people.\n\nSeparation\nof Judiciary\nfrom the\nexecutive\n\n22. The State shall ensure the separation of the judiciary from the\n\nNational\nculture\n\n23. The State shall adopt measures to conserve the cultural traditions and\n\nexecutive organs of the State.\n\nheritage of the people, and so to foster and improve the national language,\nliterature and the arts that all sections of the people are afforded the\nopportunity to contribute towards and to participate in the enrichment of\nthe national culture.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nThe culture\nof tribes,\nminor\nraces,\nethnic sects\nand\ncommunities\n\n19[23A. The State shall take steps to protect and develop the unique local\n\nNational\nmonuments,\netc.\n\n24. The State shall adopt measures for the protection against\n\nculture and tradition of the tribes, minor races, ethnic sects and\ncommunities.]\n\ndisfigurement, damage or removal of all monuments, objects or places of\nspecial artistic or historic importance or interest.\n\nPromotion\nof\ninternational\npeace,\nsecurity\nand\nsolidarity\n\n25. 20[***] The State shall base its international relations on the principles\nof respect for national sovereignty and equality, non interference in the\ninternal affairs of other countries, peaceful settlement of international\ndisputes, and respect for\ninternational law and the principles enunciated in the United Nations\nCharter, and on the basis of those principles shall –\n(a) strive for the renunciation of the use of force in international relations\nand for general and complete disarmament;\n(b) uphold the right of every people freely to determine and build up its\nown social, economic and political system by ways and means of its own\nfree choice; and\n(c) support oppressed peoples throughout the world waging a just struggle\nagainst imperialism, colonialism or racialism.\n21[***]\n\nPART III\nFUNDAMENTAL RIGHTS\nLaws\ninconsistent\nwith\nfundamental\nrights to be\nvoid\n\n26. (1) All existing law inconsistent with the provisions of this Part shall, to\nthe extent of such inconsistency, become void on the commencement of\nthis Constitution.\n(2) The State shall not make any law inconsistent with any provisions of\nthis Part, and any law so made shall, to the extent of such inconsistency,\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nbe void.\n22[(3)\n\nNothing in this article shall apply to any amendment of this\n\nConstitution made under article 142.]\nEquality\nbefore law\n\n27. All citizens are equal before law and are entitled to equal protection of\nlaw.\n\nDiscrimination 28. (1) The State shall not discriminate against any citizen on grounds only\non grounds\nof religion, race, caste, sex or place of birth.\nof religion,\netc.\n(2) Women shall have equal rights with men in all spheres of the State and\nof public life.\n(3) No citizen shall, on grounds only of religion, race, caste, sex or place of\nbirth be subjected to any disability, liability, restriction or condition with\nregard to access to any place of public entertainment or resort, or\nadmission to any educational institution.\n(4) Nothing in this article shall prevent the State from making special\nprovision in favour of women or children or for the advancement of any\nbackward section of citizens.\nEquality of\nopportunity\nin public\nemployment\n\n29. (1) There shall be equality of opportunity for all citizens in respect of\nemployment or office in the service of the Republic.\n(2) No citizen shall, on grounds only of religion, race, caste, sex or place of\nbirth, be ineligible for, or discriminated against in respect of, any\nemployment or office in the service of the Republic.\n(3) Nothing in this article shall prevent the State from –\n(a) making special provision in favour of any backward section of citizens\nfor the purpose of securing their adequate representation in the service of\nthe Republic;\n(b) giving effect to any law which makes provision for reserving\nappointments relating to any religious or denominational institution to\npersons of that religion or denomination;\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(c) reserving for members of one sex any class of employment or office on\nthe ground that it is considered by its nature to be unsuited to members of\nthe opposite sex.\nProhibition\nof foreign\ntitles, etc.\n\n23[30. No citizen shall, without the prior approval of the President, accept\n\nRight to\nprotection\nof law\n\n31. To enjoy the protection of the law, and to be treated in accordance with\n\nany title, honour, award or decoration from any foreign state.]\n\nlaw, and only in accordance with law, is the inalienable right of every\ncitizen, wherever he may be, and of every other person for the time being\nwithin Bangladesh, and in particular no action detrimental to the life,\nliberty, body, reputation or property of any person shall be taken except in\naccordance with law.\n\nProtection\nof right to\nlife and\npersonal\nliberty\n\n32. No person shall be deprived of life or personal liberty save in\n\nSafeguards\nas to arrest\nand\ndetention\n\n24[33. (1) No person who is arrested shall be detained in custody without\n\naccordance with law.\n\nbeing informed, as soon as may be, of the grounds for such arrest, nor\nshall he be denied the right to consult and be defended by a legal\npractitioner of his choice.\n(2) Every person who is arrested and detained in custody shall be\nproduced before the nearest magistrate within a period of twenty four\nhours of such arrest, excluding the time necessary for the journey from the\nplace of arrest to the Court of the magistrate, and no such person shall be\ndetained in custody beyond the said period without the authority of a\nmagistrate.\n(3) Nothing in clauses (1) and (2) shall apply to any person–\n(a) who for the time being is an enemy alien; or\n(b) who is arrested or detained under any law providing for preventive\ndetention.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(4) No law providing for preventive detention shall authorise the detention\nof a person for a period exceeding six months unless an Advisory Board\nconsisting of three persons, of whom two shall be persons who are, or\nhave been, or are qualified to be appointed as, Judges of the Supreme\nCourt and the other shall be a person who is a senior officer in the service\nof the Republic, has, after affording him an opportunity of being heard in\nperson, reported before the expiration of the said period of six months that\nthere is, in its opinion, sufficient cause for such detention.\n(5) When any person is detained in pursuance of an order made under any\nlaw providing for preventive detention, the authority making the order shall,\nas soon as may be, communicate to such person the grounds on which\nthe order has been made, and shall afford him the earliest opportunity of\nmaking a representation against the order:\nProvided that the authority making any such order may refuse to disclose\nfacts which such authority considers to be against the public interest to\ndisclose.\n(6) Parliament may by law prescribe the procedure to be followed by an\nAdvisory Board in an inquiry under clause (4).]\nProhibition\nof forced\nlabour\n\n34. (1) All forms of forced labour are prohibited and any contravention of\nthis provision shall be an offence punishable in accordance with law.\n(2) Nothing in this article shall apply to compulsory labour–\n(a) by persons undergoing lawful punishment for a criminal offence; or\n(b) required by any law for public purposes.\n\nProtection\nin respect\nof trial and\npunishment\n\n35. (1) No person shall be convicted of any offence except for violation of\na law in force at the time of the commission of the act charged as an\noffence, nor be subjected to a penalty greater than, or different from, that\nwhich might have been inflicted under the law in force at the time of the\ncommission of the offence.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(2) No person shall be prosecuted and punished for the same offence\nmore than once.\n(3) Every person accused of a criminal offence shall have the right to a\nspeedy and public trial by an independent and impartial Court or tribunal\nestablished by law.\n(4) No person accused of any offence shall be compelled to be a witness\nagainst himself.\n(5) No person shall be subjected to torture or to cruel, inhuman, or\ndegrading punishment or treatment.\n(6) Nothing in clause (3) or clause (5) shall affect the operation of any\nexisting law which prescribes any punishment or procedure for trial.\nFreedom of\nmovement\n\n36. Subject to any reasonable restrictions imposed by law in the public\ninterest, every citizen shall have the right to move freely throughout\nBangladesh, to reside and settle in any place therein and to leave and reenter Bangladesh.\n\nFreedom of\nassembly\n\n37. Every citizen shall have the right to assemble and to participate in\npublic meetings and processions peacefully and without arms, subject to\nany reasonable restrictions imposed by law in the interests of public order\nor public health.\n\nFreedom of\nassociation\n\n25[38.\n\nEvery citizen shall have the right to form associations or unions,\n\nsubject to any reasonable restrictions imposed by law in the interests of\nmorality or public order :\nProvided that no person shall have the right to form, or be a member of\nthe said association or union, if(a) it is formed for the purposes of destroying the religious, social and\ncommunal harmony among the citizens ;\n(b) it is formed for the purposes of creating discrimination among the\ncitizens, on the ground of religion, race, caste, sex, place of birth or\nlanguage ;\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(c) it is formed for the purposes of organizing terrorist acts or militant\nactivities against the State or the citizens or any other country ;\n(d) its formation and objects are inconsistent with the Constitution.]\nFreedom of\nthought and\nconscience,\nand of\nspeech\n\n39. (1) Freedom of thought and conscience is guaranteed.\n(2) Subject to any reasonable restrictions imposed by law in the interests\nof the security of the State, friendly relations with foreign states, public\norder, decency or morality, or in relation to contempt of court, defamation\nor incitement to an offence–\n(a) the right of every citizen to freedom of speech and expression; and\n(b) freedom of the press,\nare guaranteed.\n\nFreedom of\nprofession\nor\noccupation\n\n40. Subject to any restrictions imposed by law, every citizen possessing\nsuch qualifications, if any, as may be prescribed by law in relation to his\nprofession, occupation, trade or business shall have the right to enter upon\nany lawful profession or occupation, and to conduct any lawful trade or\nbusiness.\n\nFreedom of\nreligion\n\n41. (1) Subject to law, public order and morality –\n(a) every citizen has the right to profess, practise or propagate any\nreligion;\n(b) every religious community or denomination has the right to establish,\nmaintain and manage its religious institutions.\n(2) No person attending any educational institution shall be required to\nreceive religious instruction, or to take part in or to attend any religious\nceremony or worship, if that instruction, ceremony or worship relates to a\nreligion other than his own.\n\nRights to\nproperty\n\n42. (1) Subject to any restrictions imposed by law, every citizen shall have\nthe right to acquire, hold, transfer or otherwise dispose of property, and no\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nproperty shall be compulsorily acquired, nationalised or requisitioned save\nby authority of law.\n26[(2)\n\nA law made under clause (1) of this article shall provide for the\n\nacquisition, nationalisation or requisition with compensation and shall fix\nthe amount of compensation or specify the principles on which, and the\nmanner in which, the compensation is to be assessed and paid ; but no\nsuch law shall be called in question in any court on the ground that any\nprovision of the law in respect of such compensation is not adequate.]\nProtection\n43. Every citizen shall have the right, subject to any reasonable restrictions\nof home\nimposed by law in the interests of the security of the State, public order,\nand\ncorrespondencepublic morality or public health –\n(a) to be secured in his home against entry, search and seizure; and\n(b) to the privacy of his correspondence and other means of\ncommunication.\nEnforcement\nof\nfundamental\nrights\n\n27[44.\n\n(1) The right to move the High Court Division in accordance with\n\nclause (1) of article 102, for the enforcement of the rights conferred by this\nPart is guaranteed.\n(2) Without prejudice to the powers of the High Court Division under article\n102, Parliament may by law empower any other court, within the local\nlimits of its jurisdiction, to exercise all or any of those powers.]\n\nModification\nof rights in\nrespect of\ndisciplinary\nlaw\n\n45. Nothing in this Part shall apply to any provision of a disciplinary law\n\nPower to\nprovide\nindemnity\n\n46. Notwithstanding anything in the foregoing provisions of this Part,\n\nrelating to members of a disciplined force, being a provision limited to the\npurpose of ensuring the proper discharge of their duties or the\nmaintenance of discipline in that force.\n\nParliament may by law make provision for indemnifying any person in the\nservice of the Republic or any other person in respect of any act done by\nhim in connection with the national liberation struggle or the maintenance\nor restoration of order in any area in Bangladesh or validate any sentence\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\npassed, punishment inflicted, forfeiture ordered, or other act done in any\nsuch area.\nSaving for\ncertain laws\n\n47. (1) No law providing for any of the following matters shall be deemed\nto be void on the ground that it is inconsistent with, or takes away or\nabridges, any of the rights guaranteed by this Part –\n(a) the compulsory acquisition, nationalisation or requisition of any\nproperty, or the control or management thereof whether temporarily or\npermanently;\n(b) the compulsory amalgamation of bodies carrying on commercial or\nother undertakings;\n(c) the extinction, modification, restriction or regulation of rights of\ndirectors, managers, agents and officers of any such bodies, or of the\nvoting rights of persons owning shares or stock (in whatever form) therein;\n(d) the extinction, modification, restriction or regulation of rights to search\nfor or win minerals or mineral oil;\n(e) the carrying on by the Government or by a corporation owned,\ncontrolled or managed by the Government, of any trade, business,\nindustry or service to the exclusion, complete or partial, of other persons ;\nor\n(f) the extinction, modification, restriction or regulation of any right to\nproperty, any right in respect of profession, occupation, trade or business\nor the rights of employers or employees in any statutory public authority or\nin any commercial or industrial undertaking ;\nif Parliament in such law (including, in the case of existing law, by\namendment) expressly declares that such provision is made to give effect\nto any of the fundamental principles of state policy set out in Part II of this\nConstitution.\n(2) Notwithstanding anything contained in this Constitution the laws\nspecified in the First Schedule (including any amendment of any such law)\nshall continue to have full force and effect, and no provision of any such\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nlaw, nor anything done or omitted to be done under the authority of such\nlaw, shall be deemed void or unlawful on the ground of inconsistency with,\nor repugnance to, any provision of this Constitution:\n28[Provided\n\nthat nothing in this article shall prevent amendment,\n\nmodification or repeal of any such law.]\n29[(3) Notwithstanding anything contained in this Constitution, no law nor\n\nany provision thereof providing for detention, prosecution or punishment of\nany person, who is a member of any armed or defence or auxiliary forces\n30[or\n\nany individual, group of individuals or organisation] or who is a\n\nprisoner of war, for genocide, crimes against humanity or war crimes and\nother crimes under international law shall be deemed void or unlawful, or\never to have become void or unlawful, on the ground that such law or\nprovision of any such law is inconsistent with, or repugnant to, any of the\nprovisions of this Constitution.]\nInapplicability\nof certain\narticles\n\n31[47A. (1) The rights guaranteed under article 31, clauses (1) and (3) of\n\narticle 35 and article 44 shall not apply to any person to whom a law\nspecified in clause (3) of article 47 applies.\n(2) Notwithstanding anything contained in this Constitution, no person to\nwhom a law specified in clause (3) of article 47 applies shall have the right\nto move the Supreme Court for any of the remedies under this\nConstitution.]\n\nPART IV\nTHE EXECUTIVE\n\nCHAPTER I\n\n32\n\nTHE PRESIDENT\nThe\nPresident\n\n48. (1) There shall be a President of Bangladesh who shall be elected by\nmembers of Parliament in accordance with law.\n(2) The President shall, as Head of State, take precedence over all other\npersons in the State, and shall exercise the powers and perform the duties\nconferred and imposed on him by this Constitution and by any other law.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(3) In the exercise of all his functions, save only that of appointing the\nPrime Minister pursuant to clause (3) of article 56 and the Chief Justice\npursuant to clause (1) of article 95, the President shall act in accordance\nwith the advice of the Prime Minister:\nProvided that the question whether any, and if so what, advice has been\ntendered by the Prime Minister to the President shall not be enquired into\nin any court.\n(4) A person shall not be qualified for election as President if he –\n(a) is less than thirty five years of age; or\n(b) is not qualified for election as a member of Parliament; or\n(c) has been removed from the office of President by impeachment under\nthis Constitution.\n(5) The Prime Minister shall keep the President informed on matters of\ndomestic and foreign policy, and submit for the consideration of the\nCabinet any matter which the President may request him to refer to it.\nPrerogative\nof mercy\n\n49. The President shall have power to grant pardons, reprieves and\nrespites and to remit, suspend or commute any sentence passed by any\ncourt, tribunal or other authority.\n\nTerm of\noffice of\nPresident\n\n50. (1) Subject to the provisions of this Constitution, the President shall\nhold office for a term of five years form the date on which he enters upon\nhis office:\nProvided that notwithstanding the expiration of his term the President shall\ncontinue to hold office until his successor enters upon office.\n(2) No person shall hold office as President for more than two terms,\nwhether or not the terms are consecutive.\n(3) The President may resign his office by writing under his hand\naddressed to the Speaker.\n(4) The President during his term of office shall not be qualified for election\nas a member of Parliament, and if a member of Parliament is elected as\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nPresident he shall vacate his seat in Parliament on the day on which he\nenters upon his office as President.\nPresident's\nimmunity\n\n51. (1) Without prejudice to the provisions of article 52, the President shall\nnot be answerable in any court for anything done or omitted by him in the\nexercise or purported exercise of the functions of his office, but this clause\nshall not prejudice the right of any person to take proceedings against the\nGovernment.\n(2) During his term of office no criminal proceedings whatsoever shall be\ninstituted or continued against the President in, and no process for his\narrest or imprisonment shall issue from, any court.\n\nImpeachment\nof the\nPresident\n\n52. (1) The President may be impeached on a charge of violating this\nConstitution or of grave misconduct, preferred by a notice of motion signed\nby a majority of the total number of members of Parliament and delivered\nto the Speaker, setting\nout the particulars of the charge, and the motion shall not be debated\nearlier than fourteen nor later than thirty days after the notice is so\ndelivered; and the Speaker shall forthwith summon Parliament if it is not in\nsession.\n(2) The conduct of the President may be referred by Parliament to any\ncourt, tribunal or body appointed or designated by Parliament for the\ninvestigation of charge under this article.\n(3) The President shall have the right to appear and to be represented\nduring the consideration of the charge.\n(4) If after the consideration of the charge a resolution is passed by\nParliament by the votes of not less than two thirds of the total number of\nmembers declaring that the charge has been substantiated, the President\nshall vacate his office on the date on which the resolution is passed.\n(5) Where the Speaker is exercising the functions of the President under\narticle 54 the provisions of this article shall apply subject to the\nmodifications that the reference to the Speaker in clause (1) shall be\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nconstrued as a reference to the Deputy Speaker, and that the reference in\nclause (4) to the vacation by the President of his office shall be construed\nas a reference to the vacation by the Speaker of his office as Speaker; and\non the passing of a resolution such as is referred to in clause (4) the\nSpeaker shall cease to exercise the functions of President.\nRemoval of\nPresident\non ground\nof\nincapacity\n\n53. (1) The President may be removed from office on the ground of\nphysical or mental incapacity on a motion of which notice, signed by a\nmajority of the total number of members of Parliament, is delivered to the\nSpeaker, setting out particulars of the alleged incapacity.\n(2) On receipt of the notice the Speaker shall forthwith summon Parliament\nif it is not in session and shall call for a resolution constituting a medical\nboard (hereinafter in this article called “the Board”), and upon the\nnecessary motion being made and carried shall forthwith cause a copy of\nthe\nnotice to be transmitted to the President together with a request signed by\nthe Speaker that the President submit himself within a period of ten days\nfrom the date of the request to an examination by the Board.\n(3) The motion for removal shall not be put to the vote earlier than fourteen\nnor later than thirty days after notice of the motion is delivered to the\nSpeaker, and if it is again necessary to summon Parliament in order to\nenable the motion to be made within that period, the Speaker shall\nsummon Parliament.\n(4) The President shall have the right to appear and to be represented\nduring the consideration of the motion.\n(5) If the President has not submitted himself to an examination by the\nBoard before the motion is made in Parliament, the motion may be put to\nthe vote, and if it is passed by the votes of not less than two thirds of the\ntotal number of members of Parliament, the President shall vacate his\noffice on the date on which the motion is passed.\n(6) If before the motion for removal is made in Parliament, the President\nhas submitted himself to an examination by the Board, the motion shall not\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nbe put to the vote until the Board has been given an opportunity of\nreporting its opinion to Parliament.\n(7) If after consideration by Parliament of the motion and of the report of\nthe Board (which shall be submitted within seven days of the examination\nheld pursuant to clause (2) and if not so submitted shall be dispensed\nwith) the motion is passed by the votes of not less than two thirds of the\ntotal number of members of Parliament, the President shall vacate his\noffice on the date on which the resolution is passed.\nSpeaker to\nact as\nPresident\nduring\nabsence,\netc.\n\n54. If a vacancy occurs in the office of President or if the President is\nunable to discharge the functions of his office on account of absence,\nillness or any other cause the Speaker shall discharge those functions until\na President is elected or until the President resumes the functions of his\noffice, as the case may be.\n\nCHAPTER II\nTHE PRIME MINISTER AND THE CABINET\nThe Cabinet\n\n55. (1) There shall be a Cabinet for Bangladesh having the Prime Minister\nat its head and comprising also such other Ministers as the Prime Minister\nmay from time to time designate.\n(2) The executive power of the Republic shall, in accordance with this\nConstitution, be exercised by or on the authority of the Prime Minister.\n(3) The Cabinet shall be collectively responsible to Parliament.\n(4) All executive actions of the Government shall be expressed to be taken\nin the name of the President.\n(5) The President shall by rules specify the manner in which orders and\nother instruments made in his name shall be attested or authenticated,\nand the validity of any order or instrument so attested or authenticated\nshall not be questioned in any court on the ground that it was not duly\nmade or executed.\n(6) The President shall make rules for the allocation and transaction of the\nbusiness of the Government.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nMinisters\n\n56. (1) There shall be a Prime Minister, and such other Ministers, Ministers\nof State and Deputy Ministers as may be determined by the Prime\nMinister.\n(2) The appointments of the Prime Minister and other Ministers and of the\nMinisters of State and Deputy Ministers, shall be made by the President:\nProvided that not less than nine tenths of their number shall be appointed\nfrom among members of Parliament and not more than one tenth of their\nnumber may be chosen from among persons qualified for election as\nmembers of Parliament.\n(3) The President shall appoint as Prime Minister the member of\nParliament who appears to him to command the support of the majority of\nthe members of Parliament.\n(4) If occasion arises for making any appointment under clause (2) or\nclause (3) between a dissolution of Parliament and the next following\ngeneral election of members of Parliament, the persons who were such\nmembers immediately before the dissolution shall be regarded for the\npurpose of this clause as continuing to be such members.\n\nTenure of\noffice of\nPrime\nMinister\n\n57. (1) The office of the Prime Minister shall become vacant–\n(a) if he resigns from office at any time by placing his resignation in the\nhands of the President; or\n(b) if he ceases to be a member of Parliament.\n(2) If the Prime Minister ceases to retain the support of a majority of the\nmembers of Parliament, he shall either resign his office or advise the\nPresident in writing to dissolve Parliament, and if he so advises the\nPresident shall, if he is satisfied that no other member of Parliament\ncommands the support of the majority of the members of Parliament,\ndissolve Parliament accordingly.\n(3) Nothing in this article shall disqualify Prime Minister for holding office\nuntil his successor has entered upon office.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nTenure of\noffice of\nother\nMinisters\n\n58. (1) The office of a Minister other than the Prime Minister shall become\nvacant –\n(a) if he resigns from office by placing his resignation in the hands of the\nPrime Minister for submission to the President;\n(b) if he ceases to be a member of Parliament, but this shall not be\napplicable to a Minister chosen under the proviso to article 56(2);\n(c) if the President, pursuant to the provisions of clause (2), so directs; or\n(d) as provided in clause (4).\n(2) The Prime Minister may at any time request a Minister to resign, and if\nsuch Minister fails to comply with the request, may advise the President to\nterminate the appointment of such Minister.\n(3) Nothing in sub clauses (a), (b) and (d) of clause (1) shall disqualify a\nMinister for holding office during any period in which Parliament stands\ndissolved.\n(4) If the Prime Minister resigns from or ceases to hold office each of the\nother Ministers shall be deemed also to have resigned from office but\nshall, subject to the provisions of this Chapter, continue to hold office until\nhis successor has entered upon office.\n(5) In this article “Minister” includes Minister of State and Deputy Minister.\n\n[OMITTED]\n\n33[***]\n\nCHAPTER IIA\nNON PARTY CARE TAKER GOVERNMENT\n[OMITTED]\n\nOmitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of\n2011), section 21.\n\nCHAPTER III\nLOCAL GOVERNMENT\nLocal\ngovernment\n\n59. (1) Local government in every administrative unit of the Republic shall\nbe entrusted to bodies, composed of persons elected in accordance with\nlaw.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(2) Everybody such as is referred to in clause (1) shall, subject to this\nConstitution\n\nand\n\nany\n\nother\n\nlaw,\n\nperform\n\nwithin\n\nthe\n\nappropriate\n\nadministrative unit such functions as shall be prescribed by Act of\nParliament, which may include functions relating to –\n(a) administration and the work of public officers;\n(b) the maintenance of public order;\n(c) the preparation and implementation of plans relating to public services\nand economic development.\nPowers of\nlocal\ngovernment\nbodies\n\n60. For the purpose of giving full effect to the provisions of article 59\nParliament shall, by law, confer powers on the local government bodies\nreferred to in that article, including power to impose taxes for local\npurposes, to prepare their budgets and to maintain funds.]\n\nCHAPTER IV\nTHE DEFENCE SERVICES\nSupreme\ncommand\n\n34[61. The supreme command of the defence services of Bangladesh shall\n\nRecruitment,\netc., of\ndefence\nservices\n\n62. (1) Parliament shall by law provide for regulating –\n\nvest in the President and the exercise thereof shall be regulated by law.]\n\n(a) the raising and maintaining of the defence services of Bangladesh and\nof their reserves;\n(b) the grant of commissions therein;\n(c) the appointment of chiefs of staff of the defence services, and their\nsalaries and allowances ; and\n(d) the discipline and other matters relating to those services and reserves.\n(2) Until Parliament by law provides for the matters specified in clause (1)\nthe President may, by order, provide for such of them as are not already\nsubject to existing law.\n\nWar\n\n63. (1) War shall not be declared and the Republic shall not participate in\nany war except with the assent of Parliament.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n35[* * *]\n\nCHAPTER V\nTHE ATTORNEY-GENERAL\nThe\nAttorneyGeneral\n\n64. (1) The President shall appoint a person who is qualified to be\nappointed as a Judge of the Supreme Court to be Attorney-General\nfor Bangladesh.\n(2) The Attorney-General shall perform such duties as may be\nassigned to him by the President.\n(3) In the performance of his duties, the Attorney-General shall have\nthe right of audience in all courts of Bangladesh.\n(4) The Attorney-General shall hold office during the pleasure of the\nPresident, and shall receive such remuneration as the President may\ndetermine.\n\nPART V\nTHE LEGISLATURE\n\nCHAPTER I\nPARLIAMENT\nEstablishment 65. (1) There shall be a Parliament for Bangladesh (to be known as the\nof\nHouse of the Nation) in which, subject to the provisions of this\nParliament\nConstitution, shall be vested the legislative powers of the Republic:\nProvided that nothing in this clause shall prevent Parliament from\ndelegating to any person or authority, by Act of Parliament, power to make\norders, rules, regulations, bye laws or other instruments having legislative\neffect.\n(2) Parliament shall consist of three hundred members to be elected in\naccordance with law from single territorial constituencies by direct election\nand, for so long as clause (3) is effective, the members provided for in that\nclause; the members shall be designated as Members of Parliament.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n36[(3) Until the dissolution of Parliament occurring next after the expiration\n\nof the period of twenty five years beginning from the date of the first\nmeeting of the Parliament next after the Parliament in existence at the time\nof the commencement of the Constitution (Seventeenth Amendment) Act,\n2018, there shall be reserved fifty seats exclusively for women members\nand they will be elected by the aforesaid members in accordance with law\non the basis of procedure of proportional representation in the Parliament\nthrough single transferable vote :\nProvided that nothing in this clause shall be deemed to prevent a woman\nfrom being elected to any of the seats provided for in clause (2) of this\narticle.]\n37[(3A) For the remaining period of the Parliament in existence at the time\n\nof the commencement of the Constitution (Fifteenth Amendment) Act,\n2011, Parliament shall consist of three hundred members elected by direct\nelection provided for in clause (2) and fifty women members provided for in\nclause (3).]\n(4) The seat of Parliament shall be in the capital.\nQualifications 66. (1) A person shall subject to the provisions of clause (2), be qualified to\nand\nbe elected as, and to be, a member of Parliament if he is a citizen of\ndisqualifications\nfor election\nBangladesh and has attained the age of twenty-five years.\nto\n(2) A person shall be disqualified for election as, or for being, a member of\nParliament\nParliament who –\n(a) is declared by a competent court to be of unsound mind;\n(b) is an undischarged insolvent;\n(c) acquires the citizenship of, or affirms or acknowledges allegiance to, a\nforeign state;\n(d) has been, on conviction for a criminal offence involving moral turpitude,\nsentenced to imprisonment for a term of not less than two years, unless a\nperiod of five years has elapsed since his release; 38[* * *]\n\n25/04/2022\n\n39[(e)\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nhas been convicted of any offence under the Bangladesh\n\nCollaborators (Special Tribunals) Order, 1972 ;\n(f) holds any office of profit in the service of the Republic other than an\noffice which is declared by law not to be disqualified its holder ; or]\n(g) is disqualified for such election by or under any law.\n40[(2A) Notwithstanding anything contained in sub-clause (c) of clause (2)\n\nof this article, if any person being a citizen of Bangladesh by birth acquires\nthe citizenship of a foreign State and thereafter such person(i) in the case of dual citizenship, gives up the foreign citizenship ; or\n(ii) in other cases, again accepts the citizenship of Bangladeshfor the purposes of this article, he shall not be deemed to acquire the\ncitizenship of a foreign State.]\n41[(3) For the purposes of this article, a person shall not be deemed to hold\n\nan office of profit in the service of the Republic by reason only that he is\nthe President, the Prime Minister, the Speaker, the Deputy Speaker, a\nMinister, Minister of State or Deputy Minister.]\n(4) If any dispute arises as to whether a member of Parliament has, after\nhis election, become subject to any of the disqualifications mentioned in\nclause (2) or as to whether a member of Parliament should vacate his seat\npursuant to article 70, the dispute shall be referred to the Election\nCommission to hear and determine it and the decision of the Commission\non such reference shall be final.\n(5) Parliament may, by law, make such provision as it deems necessary for\nempowering the Election Commission to give full effect to the provisions of\nclause (4).\nVacation of\nseats of\nmembers\n\n67. (1) A member of Parliament shall vacate his seat –\n(a) if fails, within the period of ninety days from the date of the first meeting\nof Parliament after his election, to make and subscribe 42[* * *] the oath or\naffirmation prescribed for a member of Parliament in the Third Schedule:\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nProvided that the Speaker may, before the expiration of that period, for\ngood cause extend it;\n(b) if he is absent from Parliament, without the leave of Parliament, for\nninety consecutive sitting days;\n(c) upon a dissolution of Parliament;\n(d) if he has incurred a disqualification under clause (2) of article 66; or\n(e) in the circumstances specified in article 70.\n(2) A member of Parliament may resign his seat by writing under his hand\naddressed to the Speaker, and the seat shall become vacant when the\nwriting is received by the Speaker or, if the office of Speaker is vacant or\nthe Speaker is for any reason unable to perform his functions, by the\nDeputy Speaker.\nRemuneration, 68. Members of Parliament shall be entitled to such 43[remuneration],\netc., of\nallowances and privileges as may be determined by Act of Parliament or,\nmembers of\nParliament\nuntil so determined, by order made by the President.\nPenalty for\nmember\nsitting or\nvoting\nbefore\ntaking oath\n\n69. If a person sits or votes as a member of Parliament before he makes\nor subscribes the oath or affirmation in accordance with this Constitution,\nor when he knows that he is not qualified or is disqualified for membership\nthereof, he shall be liable in respect of each day on which he so sits or\nvotes to a penalty of one thousand taka to be recovered as a debt due to\nthe Republic.\n\nVacation of\nseat on\nresignation\nor voting\nagainst\npolitical\nparty\n\n44[70. A person elected as a member of Parliament at an election at which\n\nhe was nominated as a candidate by a political party shall vacate his seat\nif he –\n(a) resigns from that party ; or\n(b) votes in Parliament against that party ;\nbut shall not thereby be disqualified for subsequent election as a member\nof Parliament.]\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nBar against\ndouble\nmembership\n\n71. (1) No person shall at the same time be a member of Parliament in\nrespect of two or more constituencies.\n(2) Nothing in clause (1) shall prevent a person from being at the same\ntime a candidate for two or more constituencies, but in the event of his\nbeing elected for more than one –\n(a) within thirty days after his last election the person elected shall deliver\nto the Chief Election Commissioner a signed declaration specifying the\nconstituency which he wishes to represent, and the seats of the other\nconstituencies for which he was elected shall thereupon fall vacant;\n(b) if the person elected fails to comply with sub clause (a) all the seats for\nwhich he was elected shall fall vacant; and\n(c) the person elected shall not make or subscribe the oath or affirmation\nof a member of Parliament until the foregoing provisions of this clause, so\nfar as applicable, have been complied with.\n\nSessions of\nParliament\n\n72. (1) Parliament shall be summoned, prorogued and dissolved by the\nPresident by public notification, and when summoning Parliament the\nPresident shall specify the time and place of the first meeting:\n45[Provided that 46[except the period of ninety days as mentioned in sub-\n\nclause (a) of clause (3) of article 123 for remaining term] a period\nexceeding sixty days shall not intervene between the end of one session\nand the first sitting of Parliament in the next session:\nProvided further that in the exercise of his functions under this clause, the\nPresident shall act in accordance with the advice of the Prime Minister\ntendered to him in writing.]\n(2) Notwithstanding the provisions of clause (1) Parliament shall be\nsummoned to meet within thirty days after the declaration of the results of\npolling at any general election of members of Parliament.\n(3) Unless sooner dissolved by the President, Parliament shall stand\ndissolved on the expiration of the period of five years from the date of its\nfirst meeting:\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nProvided that at any time when the Republic is engaged in war the period\nmay be extended by Act of Parliament by not more than one year at a time\nbut shall not be so extended beyond six months after the termination of the\nwar.\n(4) If after a dissolution and before the holding of the next general election\nof members of Parliament the President is\nsatisfied that owing to the existence of a state of war in which the Republic\nis engaged it is necessary to recall Parliament, the President shall\nsummon the Parliament that has been dissolved to meet.\n47[* * *]\n\n(5) Subject to the provisions of clause (1) the sittings of Parliament shall\nbe held at such times and places as Parliament may, by its rules of\nprocedure or otherwise determine.\nPresident’s\naddress\nand\nmessages\nto\nParliament\n\n73. (1) The President may address Parliament and may send messages\nthereto.\n(2) At the commencement of the first session after a general election of\nmembers of Parliament and at the commencement of the first session of\neach year the President shall address Parliament.\n(3) Parliament shall, after the presentation of an address by the President,\nor the receipt of a message from him, discuss the matter referred to in\nsuch address or message.\n\nRights of\nMinisters as\nrespects\nParliament\n\n48[73A. (1) Every Minister shall have the right to speak in, and otherwise to\n\ntake part in the proceedings of, Parliament, but shall not be entitled to vote\n49[or\n\nto speak on any matter not related to his Ministry] unless he is a\n\nmember of Parliament also.\n(2) In this article, “Minister” includes a Prime Minister, 50[* * *], Minister of\nState and Deputy Minister.]\nSpeaker\nand Deputy\nSpeaker\n\n74. (1) Parliament shall at the first sitting after any general election elect\nfrom among its members a Speaker and a Deputy Speaker, and if either\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\noffice becomes vacant shall within seven days or, if Parliament is not then\nsitting, at its first meeting thereafter, elect one of its members to fill the\nvacancy.\n(2) The Speaker or Deputy Speaker shall vacate his office –\n(a) if he ceases to be a member of Parliament;\n(b) it he becomes a Minister;\n(c) if Parliament passes a resolution (after not less than fourteen days'\nnotice has been given of the intention to move the resolution) supported by\nthe votes of a majority of all the members thereof, requiring his removal\nfrom office;\n(d) it he resigns his office by writing under his hand delivered to the\nPresident;\n(e) if after a general election another member enters upon that office; or\n(f) in the case of the Deputy Speaker, if he enters upon the office of\nSpeaker.\n(3) While the office of the Speaker is vacant or the Speaker is 51[acting as]\nPresident, or if it is determined by Parliament that the Speaker is otherwise\nunable to perform the functions of his office, those functions shall be\nperformed by the Deputy Speaker or, if the office of the Deputy Speaker is\nvacant, by such member of Parliament as may be determined by or under\nthe rules of procedure of Parliament; and during the absence of the\nSpeaker from any sitting of Parliament the Deputy Speaker or, if he also is\nabsent, such person as may be determined by or under the rules of\nprocedure, shall act as Speaker.\n(4) At any sitting of Parliament, while a resolution for the removal of the\nSpeaker from his office is under consideration the Speaker (or while any\nresolution for the removal of the Deputy Speaker from his office is under\nconsideration, the Deputy Speaker) shall not preside, and the provisions of\nclause (3) shall apply in relation to every such sitting as they apply in\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nrelation to a sitting from which the Speaker or, as the case may be, the\nDeputy Speaker is absent.\n(5) The Speaker or the Deputy Speaker, as the case may be, shall have\nthe right to speak in, and otherwise to take part in, the proceedings of\nParliament while any resolution for his removal from office is under\nconsideration in Parliament, and shall be entitled to vote but only as a\nmember.\n(6) Notwithstanding the provisions of clause (2) the Speaker or, as the\ncase may be, the Deputy Speaker, shall be deemed to continue to hold\noffice until his successor has entered upon office.\nRules of\nprocedure,\nquorum,\netc.\n\n75. (1) Subject to this Constitution –\n(a) the procedure of Parliament shall be regulated by rules of procedure\nmade by it, and until such rules are made shall be regulated by rules of\nprocedure made by the President;\n(b) a decision in Parliament shall be taken by a majority of the votes of the\nmembers present and voting, but the person presiding shall not vote\nexcept when there is an equality of votes, in which case he shall exercise\na casting vote;\n(c) no proceeding in Parliament shall be invalid by reason only that there is\na vacancy in the membership thereof or that a person who was not entitled\nto do so was present at, or voted or otherwise participated in, the\nproceeding.\n(2) If at any time during which Parliament is in session the attention of the\nperson presiding is drawn to the fact that the number of members present\nis less than sixty, he shall either suspend the meeting until at least sixty\nmembers are present, or adjourn it.\n\nStanding\ncommittees\nof\nParliament\n\n76. (1) 52[* * *] Parliament shall appoint from among its members the\nfollowing standing committees, that is to say –\n(a) a public accounts committee;\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(b) committee of privileges; and\n(c) such other standing committees as the rules of procedure of Parliament\nrequire.\n(2) In addition to the committees referred to in clause (1), Parliament shall\nappoint other standing committees, and a committee so appointed may,\nsubject to this Constitution and to any other law (a) examine draft Bills and other legislative proposals;\n(b) review the enforcement of laws and propose measures for such\nenforcement;\n(c) in relation to any matter referred to it by Parliament as a matter of\npublic importance, investigate or inquire into the activities or administration\nof a Ministry and may require it to furnish, through an authorised\nrepresentative, relevant information and to answer questions, orally or in\nwriting;\n(d) perform any other function assigned to it by Parliament.\n(3) Parliament may by law confer on committees appointed under this\narticle powers for –\n(a) enforcing the attendance of witnesses and examining them on oath,\naffirmation or otherwise;\n(b) compelling the production of documents.\nOmbudsman\n\n77. (1) Parliament may, by law, provide for the establishment of the office\nof Ombudsman.\n(2) The Ombudsman shall exercise such powers and perform such\nfunctions as Parliament may, by law, determine, including the power to\ninvestigate any action taken by a Ministry, a public officer or a statutory\npublic authority.\n(3) The Ombudsman shall prepare an annual report concerning the\ndischarge of his functions, and such report shall be laid before Parliament.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nPrivileges\nand\nimmunities\nof\nParliament\nand\nmembers\n\n78. (1) The validity of the proceedings in Parliament shall not be\nquestioned in any court.\n(2) A member or officer of Parliament in whom powers are vested for the\nregulation of procedure, the conduct of business or the maintenance of\norder in Parliament, shall not in relation to the exercise by him of any such\npowers be subject to the jurisdiction of any court.\n(3) A member of Parliament shall not be liable to proceedings in any court\nin respect of anything said, or any vote given, by him in Parliament or in\nany committee thereof.\n(4) A person shall not be liable to proceedings in any court in respect of\nthe publication by or under the authority of Parliament of any report, paper,\nvote or proceeding.\n(5) Subject to this article, the privileges of Parliament and of its committees\nand member may be determined by Act of Parliament.\n\nSecretariat\nof\nParliament\n\n79. (1) Parliament shall have its own secretariat.\n(2) Parliament may, by law, regulate the recruitment and conditions of\nservice of persons appointed to the secretariat of Parliament.\n(3) Until provision is made by Parliament the President may, after\nconsultation with the Speaker, make rules regulating the recruitment and\ncondition of service of persons appointed to the secretariat of Parliament,\nand rules so made shall have effect subject to the provisions of any law.\n\nCHAPTER II\nLEGISLATIVE AND FINANCIAL PROCEDURES\nLegislative\nprocedure\n\n80. (1) Every proposal in Parliament for making a law shall be made in the\nform of a Bill.\n(2) When a Bill is passed by Parliament it shall be presented to the\nPresident for assent.\n53[(3) The President within fifteen days after a Bill is presented to him, shall\n\nassent to the Bill or, in the case of a Bill other than a Money Bill, may\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nreturn it to Parliament with a message requesting that the Bill or any\nparticular provisions thereof be reconsidered, and that any amendments\nspecified by him in the message be considered ; and if he fails so to do he\nshall be deemed to have assented to the Bill at the expiration of that\nperiod.]\n(4) If the President so returns the Bill Parliament shall consider it together\nwith the President's message, and if the Bill is again passed by Parliament\nwith or without amendments 54[***], it shall be presented to the President\nfor his assent, whereupon the President shall assent to the Bill within the\nperiod of seven days after it has been presented to him, and if he fails to\ndo so he shall be deemed to have assented to the Bill on the expiration of\nthat period.\n(5) When the President has assented or is deemed to have assented to a\nBill passed by Parliament it shall become law and shall be called an Act of\nParliament.\nMoney Bills\n\n81. (1) In this Part “Money Bill” means a Bill containing only provisions\ndealing with all or any of the following matters –\n(a) the imposition, regulation, alteration, remission or repeal of any tax;\n(b) the borrowing of money or the giving of any guarantee by the\nGovernment, or the amendment of any law relating to the financial\nobligations of the Government;\n(c) the custody of the Consolidated Fund, the payment of money into, or\nthe issue or appropriation of moneys from, that Fund;\n(d) the imposition of a charge upon the Consolidated Fund or the alteration\nor abolition of any such charge;\n(e) the receipt of moneys on account of the Consolidated Fund or the\nPublic Account of the Republic, or the custody or issue of such moneys, or\nthe audit of the accounts of the Government;\n(f) any subordinate matter incidental to any of the matters specified in the\nforegoing sub clauses.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(2) A Bill shall not be deemed to be a Money Bill by reason only that it\nprovides for the imposition or alteration of any fine or other pecuniary\npenalty, or for the levy or payment of a licence fee or a fee or charge for\nany service rendered, or by reason only that it provides for the imposition,\nregulation, alteration, remission or repeal of any tax by a local authority or\nbody for local purposes.\n(3) Every Money Bill shall, when it is presented to the President for his\nassent, bear a certificate under the hand of the Speaker that it is a Money\nBill, and such certificate shall be conclusive for all purposes and shall not\nbe questioned in any court.\nRecommendation\n82. No Money Bill, or any Bill which involves expenditure from public\nfor financial\nmoneys, shall be introduced into Parliament except on the\nmeasures\nrecommendation of the President:\nProvided that 55[in any Mony Bill] no recommendation shall be required\nunder this article for the moving of an amendment making provision for the\nreduction or abolition of any tax.\nNo taxation\nexcept by\nor under\nAct of\nParliament\nConsolidated\nFund and\nthe Public\nAccount of\nthe\nRepublic\n\n83. No tax shall be levied or collected except by or under the authority of\nan Act of Parliament.\n\n84. (1) All revenues received by the Government, all loans raised by the\nGovernment, and all moneys received by it in repayment of any loan, shall\nform part of one fund to be known as the Consolidated Fund.\n(2) All other public moneys received by or on behalf of the Government\nshall be credited to the Public Account of the Republic.\n\nRegulation\nof Public\nmoneys\n\n85. The custody of public moneys, their payment into and the withdrawal\nfrom the Consolidated Fund or, as the case may be, the Public Account of\nthe Republic, and matters connected with or ancillary to the matters\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\naforesaid, shall be regulated by Act of Parliament, and until provision in\nthat behalf is so made, by rules made by the President.\nMoneys\npayable to\nPublic\nAccount of\nRepublic\n\n86. All moneys received by or deposited with –\n(a) any person employed in the service of the Republic or in connection\nwith the affairs of the Republic, other than revenues or moneys which by\nvirtue of clause (1) of article 84 shall form part of the Consolidated Fund;\nor\n(b) any court to the credit of any cause, matter, account or persons,\nshall be paid into the Public Account of the Republic.\n\nAnnual\nfinancial\nstatement\n\n87. (1) There shall be laid before Parliament, in respect of each financial\nyear, a statement of the estimated receipts and expenditure of the\nGovernment for that year, in this Part referred to as the annual financial\nstatement.\n(2) The annual financial statement shall show separately –\n(a) the sums required to meet expenditure charged by or under this\nConstitution upon the Consolidated Fund; and\n(b) the sums required to meet other expenditure proposed to be made\nfrom the Consolidated Fund;\nand shall distinguish expenditure on revenue account from other\nexpenditure.\n\nCharges on\nConsolidated\nFund\n\n88. The following expenditure shall be charged upon the Consolidated\nFund –\n(a) the remuneration payable to the President and other expenditure\nrelating to his office;\n56[* * *]\n\n(b) the remuneration payable to –\n(i) the Speaker and Deputy Speaker;\n57[(ii) the Judges of the Supreme Court ;]\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(iii) the Comptroller and Auditor General;\n(iv) the Election Commissioners;\n(v) the members of the Public Service Commissions;\n58[(c) the\n\nadministrative expenses of, including remuneration payable to,\n\nofficers and servants of Parliament, the Supreme Court, the Comptroller\nand Auditor General, the Election Commission and the Public Service\nCommissions.]\n(d) all debt charges for which the Government is liable, including interest,\nsinking fund charges, the repayment or amortisation of capital, and other\nexpenditure in connection with the raising of loans and the service and\nredemption of debt;\n(e) any sums required to satisfy a judgment, decree or award against the\nRepublic by any court or tribunal; and\n(f) any other expenditure charged upon the Consolidated Fund by this\nConstitution or by Act of Parliament.\nProcedure\nrelating to\nannual\nfinancial\nstatement\n\n89. (1) So much of the annual financial statement as relates to expenditure\ncharged upon the Consolidated Fund may be discussed in, but shall not\nbe submitted to the vote of, Parliament.\n(2) So much of the annual financial statement as relates to other\nexpenditure shall be submitted to Parliament in the form of demands for\ngrants, and Parliament shall have power to assent to or to refuse to assent\nto any demand, or to assent to it subject to a reduction of the amount\nspecified therein.\n(3) No demand for a grant shall be made except on the recommendation\nof the President.\n\nAppropriation\nAct\n\n90. (1) As soon as may be after the grants under article 89 have been\nmade by Parliament there shall be introduced in Parliament a Bill to\nprovide for appropriation out of the Consolidated Fund of all moneys\nrequired to meet–\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(a) the grants so made by Parliament; and\n(b) the expenditure charged on the Consolidated Fund but not exceeding\nin any case the amount shown in the annual financial statement laid before\nParliament.\n(2) No amendment shall be proposed in Parliament to any such Bill which\nhas the effect of varying the amount of any grant so made or altering the\npurpose to which it is to be applied, or of varying the amount of any\nexpenditure charged on the Consolidated Fund.\n(3) Subject to the provisions of this Constitution no money shall be\nwithdrawn from the Consolidated Fund except under appropriation made\nby law passed in accordance with the provisions of this article.\nSupplementary 91. If in respect of any financial year it is found –\nand excess\ngrants\n(a) that the amount authorised to be expended for a particular service for\nthe current financial year is insufficient or that a need has arisen for\nexpenditure upon some new service not included in the annual financial\nstatement for that year; or\n(b) that any money has been spent on a service during a financial year in\nexcess of the amount granted for that service for that year;\nthe President shall have power to authorise expenditure from the\nConsolidated Fund whether or not it is charged by or under the\nConstitution upon that Fund and shall cause to be laid before Parliament a\nsupplementary financial statement setting out the estimated amount of the\nexpenditure or, as the case may be, an excess financial statement setting\nout the amount of the excess, and the provisions of articles 87 to 90 shall\n(with the necessary adaptations) apply in relation to those statements as\nthey apply in relation to the annual financial statement.\nVotes of\naccount,\nvotes of\ncredit, etc.\n\n92. (1) Notwithstanding anything in the foregoing provisions of this\nChapter, Parliament shall have power\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(a) to make any grant in advance in respect of the estimated expenditure\nfor a part of any financial year pending the completion of the procedure\nprescribed in article 89 for the voting of such grant and the passing of a\nlaw in accordance with the provisions of article 90 in relation to that\nexpenditure;\n(b) to make a grant for meeting an unexpected demand upon the\nresources of the Republic when on account of the magnitude or the\nindefinite character of the service the demand cannot be specified with the\ndetails ordinarily given in an annual financial statement;\n(c) to make an exceptional grant which forms no part of the current service\nof any financial year;\nand Parliament shall have power to authorise by law the withdrawal of\nmoneys from the Consolidated Fund for the purposes for which such\ngrants are made.\n(2) The provisions of articles 89 and 90 shall have effect in relation to the\nmaking of any grant under clause (1), and to any law to be made under\nthat clause, as they have effect in relation to the making of a grant with\nregard to any expenditure mentioned in the annual financial statement and\nto the law to be made for the authorisation of appropriation of moneys out\nof the Consolidated Fund to meet such expenditure.\n59[(3)\n\nNotwithstanding anything contained in the foregoing provisions of\n\nthis Chapter, if, in respect of a financial year, Parliament(a) has failed to make the grants under article 89 and pass the law under\narticle 90 before the beginning of that year and has not also made any\ngrant in advance under this article; or\n(b) has failed to make the grants under article 89 and pass the law under\narticle 90 before the expiration of the period for which the grants in\nadvance, if any, were made under this article,\nthe President may, upon the advice of the Prime Minister, by order,\nauthorise the withdrawal from the Consolidated Fund moneys necessary\nto meet expenditure mentioned in the financial statement for that year for a\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nperiod not exceeding sixty days in that year, pending the making of the\ngrants and passing of the law.]\n[Omitted]\n\n92A. [Authorisation of expenditure in certain cases.- omitted by section 10\nof the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of\n1991).]\n\nCHAPTER III\nORDINANCE MAKING POWER\nOrdinance\nmaking\npower\n\n93. (1) At any time when 60[Parliament stands dissolved or is not in\nsession], if the President is satisfied that circumstances exist which render\nimmediate action necessary, he may make and promulgate such\nOrdinances as the circumstances appear to him to require, and any\nOrdinance so made shall, as from its promulgation have the like force of\nlaw as an Act of Parliament:\nProvided that no Ordinance under this clause shall make any provision –\n(i) which could not lawfully be made under this Constitution by Act of\nParliament;\n(ii) for altering or repealing any provision of this Constitution; or\n(iii) continuing in force any provision of an Ordinance previously made.\n(2) An Ordinance made under clause (1) shall be laid before Parliament at\nits first meeting following the promulgation of the Ordinance and shall,\nunless it is earlier repealed, cease to have effect at the expiration of thirty\ndays after it is so laid or, if a resolution disapproving of the Ordinance is\npassed by Parliament before such expiration, upon the passing of the\nresolution.\n(3) At any time when Parliament stands dissolved, the President may, if he\nis satisfied that circumstances exist which render such action necessary,\nmake and promulgate an Ordinance authorising expenditure from the\nConsolidated Fund, whether the expenditure is charged by the\nConstitution upon that fund or not, and any Ordinance so made shall, as\nfrom its promulgation, have the like force of law as an Act of Parliament.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(4) Every Ordinance promulgated under clause (3) shall be laid before\nParliament as soon as may be, and the provisions of articles 87, 89 and 90\nshall, with necessary adaptations, be complied with in respect thereof\nwithin thirty days of the reconstitution of Parliament.\n\nPART VI\nTHE JUDICIARY\n\nCHAPTER I\n\n61\n\nTHE SUPREME COURT\nEstablishment 94. (1) There shall be a Supreme Court for Bangladesh (to be known as\nof Supreme\nthe Supreme Court of Bangladesh) comprising the Appellate Division and\nCourt\nthe High Court Division.\n(2) The Supreme Court shall consist of the Chief Justice, to be known as\nthe Chief Justice of Bangladesh, and such number of other Judges as the\nPresident may deem it necessary to appoint to each division.\n(3) The Chief Justice, and the Judges appointed to the Appellate Division,\nshall sit only in that division, and the other Judges shall sit only in the High\nCourt Division.\n(4) Subject to the provisions of this Constitution the Chief Justice and the\nother Judges shall be independent in the exercise of their judicial\nfunctions.\nAppointment\nof Judges\n\n95. (1) The Chief Justice shall be appointed by the President, and the\nother Judges shall be appointed by the President after consultation with\nthe Chief Justice.\n(2) A person shall not be qualified for appointment as a Judge unless he is\na citizen of Bangladesh and –\n(a) has, for not less than ten years, been an advocate of the Supreme\nCourt ; or\n(b) has, for not less than ten years, held judicial office in the territory of\nBangladesh ; or\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(c) has such qualifications as may be prescribed by law for appointment as\na Judge of the Supreme Court.\n(3) In this article, “Supreme Court” includes a court which at any time\nbefore the commencement of this Constitution exercised jurisdiction as a\nHigh Court in the territory of Bangladesh.\nTenure of\noffice of\nJudges\n\n96. (1) Subject to the other provisions of this article, a Judge shall hold\noffice until he attains the age of sixty-seven years.\n62[(2) A Judge shall not be removed from his office except by an order of\n\nthe President passed pursuant to a resolution of Parliament supported by\na majority of not less than two-thirds of the total number of members of\nParliament, on the ground of proved misbehaviour or incapacity.\n(3) Parliament may by law regulate the procedure in relation to a resolution\nunder clause (2) and for investigation and proof of the misbehaviour or\nincapacity of a Judge.\n(4) A Judge may resign his office by writing under his hand addressed to\nthe President.]\nTemporary\nappointment\nof Chief\nJustice\n\n97. If the office of the Chief Justice becomes vacant, or if the President is\nsatisfied that the Chief Justice is, on account of absence, illness, or any\nother cause, unable to perform the functions of his office, those functions\nshall, until some other person has entered upon that office, or until the\nChief Justice has resumed his duties, as the case may be, be performed\nby the next most senior Judge of the Appellate Division.\n\nAdditional\nSupreme\nCourt\nJudges\n\n98. Notwithstanding the provisions of article 94, if the President is satisfied\nthat the number of the Judges of a division of the Supreme Court should\nbe for the time being increased, the President may appoint one or more\nduly qualified persons to be Additional Judges of that division for such\nperiod not exceeding two years as he may specify, or, if he thinks fit, may\nrequire a Judge of the High Court Division to sit in the Appellate Division\nfor any temporary period :\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nProvided that nothing in this article shall prevent a person appointed as\nan Additional Judge from being appointed as a Judge under article 95 or\nas an Additional Judge for a further period under this article.\nDisabilities\nof Judges\nafter\nretirement\n\n99. (1) A person who has held office as a Judge (otherwise than as an\nAdditional Judge pursuant to the provisions of article 98), shall not, after\nhis retirement or removal therefrom, plead or act before any court or\nauthority or hold any offece of profit in the service of the Republic not\nbeing a judicial or quasi-judicial office.\n(2) Notwithstanding anything contained in clause (1), a person who has\nheld office as a Jugde of the High Court Division may, after his retirement\nor rermoval therefrom, plead or act before the Appellate Division.\n\nSeat of\nSupreme\nCourt\n\n100. The permanent seat of the Supreme Court shall be in the capital, but\nsessions of the High Court Division may be held at such other place or\nplaces as the Chief Justice may, with the approval of the President, from\ntime to time appoint.\n\nJurisdiction\nof High\nCourt\nDivision\n\n101. The High Court Division shall have such original, appellate and other\n\nPowers of\nHigh Court\nDivision to\nissue\ncertain\norders and\ndirections,\netc.\n\n102. (1) The High Court Division on the application of any person\n\njurisdictions and powers as are conferred on it by this Constitution or any\nother law.\n\naggrieved, may give such directions or orders to any person or authority,\nincluding any person performing any function in connection with the affairs\nof the Republic, as may be appropriate for the enforcement of any of the\nfundamental rights conferred by Part III of this Constitution.\n(2) The High Court Division may, if satisfied that no other equally\nefficacious remedy is provided by law –\n(a) on the application of any person aggrieved, make an order(i) directing a person performing any functions in connec-tion with the\naffairs of the Republic or of a local authority,\nto refrain from doing that which he is not permitted by law to do or to do\nthat which he is required by law to do ; or\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(ii) declaring that any act done or proceeding taken by a person performing\nfunctions in connection with the affairs of the Republic or of a local\nauthority, has been done or taken without lawful authority and is of no legal\neffect ; or\n(b) on the application of any person, make an order(i) directing that a person in custody be brought before it so that it may\nsatisfy itself that he is not being held in custody without lawful authority or\nin an unlawful manner ; or\n(ii) requiring a person holding or purporting to hold a public office to show\nunder what authority he claims to hold that office.\n(3) Notwithstanding anything contained in the forgoing clauses, the High\nCourt Division shall have no power under this article to pass any interim or\nother order in relation to any law to which article 47 applies.\n(4) Whereon an application made under clause (1) or sub-clause (a) of\nclause (2), an interim order is prayed for and such interim order is likely to\nhave the effect of(a) prejudicing or interfering with any measure designed to implement any\ndevelopment programme, or any development work ; or\n(b) being otherwise harmful to the public interest, the High Court Division\nshall not make an interim order unless the Attorney-General has heen\ngiven reasonable notice of the application and he (or an advocate\nauthorised by him in that behalf) has been given an opportunity of being\nheard, and the High Court Division is satisfied that the interim order would\nnot have the effect referred to in sub-clause (a) or sub-caluse (b).\n(5) In this article, unless the context otherwise requires, “person” includes\na statutory public authority and any court or tribunal, other than a court or\ntribunal established under a law relating to the defence services of\nBangladesh or any disciplined force or a tribunal to which article 117\napplies.\nJurisdiction\nof Appellate\nDivision\n\n103. (1) The Appellate Division shall have jurisdiction to hear and\ndetermine appeals from judgments, decrees, orders or sentences of the\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nHigh Court Division.\n\n(2) An appeal to the Appellate Division from a judgment, decree, order or\nsentence of the High Court Division shall lie as of right where the High\nCourt Division –\n(a) certifies that the case involves a substantial question of law as to the\ninterpretation of this Constitution ; or\n(b) has confirmed a sentence of death or sentenced a person to death or\nto imprisonment for life ; or\n(c) has imposed punishment on a person for contempt of that division ;\nand in such other cases as may be provided for by Act of Parliament.\n(3) An appeal to the Appellate Division from a judgment, decree, order or\nsentence of the High Court Division in a case to which clause (2) does not\napply shall lie only if the Appellate Division grants leave to appeal.\n(4) Parliament may by law declare that the provisions of this article shall\napply in relation to any other court or tribunal as they apply in relation to\nthe High Court Division.\nIssue and\nexecution\nof\nprocesses\nof Appellate\nDivision\n\n104. The Appellate Division shall have power to issue such directions,\norders, decrees or writs as may be necessary for doing complete justice in\nany cause or matter pending before it, including orders for the purpose of\nsecuring the attendance of any person or the discovery or production of\nany document.\n\nReview of\njudgments\nor orders\nby\nAppellate\nDivision\n\n105. The Appellate Division shall have power, subject to the provisions of\n\nAdvisory\njurisdiction\nof Supreme\nCourt\n\n106. If at any time it appears to the President that a question of law has\n\nany Act of Parliament and of any rules made by that division to review any\njudgment pronounced or order made by it.\n\narisen, or is likely to arise, which is of such a nature and of such public\nimportance that it is expedient to obtain the opinion of the Supreme Court\nupon it, he may refer the question to the Appellate Division for\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nconsideration and the division may, after such hearing as it thinks fit, report\nits opinion thereon to the President.\nRulemaking\npower of\nthe\nSupreme\nCourt\n\n107. (1) Subject to any law made by Parliament the Supreme Court may,\nwith the approval of the President, make rules for regulating the practice\nand procedure of each division of the Supreme Court and of any court\nsubordinate to it.\n(2) The Supreme Court may delegate any of its functions under clause (1)\nand article 113 and 116 to a division of that Court or to one or more\njudges.\n(3) Subject to any rules made under this article the Chief Justice shall\ndetermine which judges are to constitute any Bench of a division of the\nSupreme Court and which judges are to sit for any purpose.\n(4) The Chief Justice may authorise the next most senior judge of either\ndivision of the Supreme Court to exercise in that division any of the powers\nconferred by clause (3) or by rules made under this article.\n\nSupreme\nCourt as\ncourt of\nrecord\n\n108. The Supreme Court shall be a court of record and shall have all the\npowers of such a court including the power subject to law to make an\norder for the investigation of or punishment for any contempt of itself.\n\nSuperintendence109. The High Court Division shall have superintendence and control over\nand control\nall courts and tribunals subordinate to it.\nover courts\nTransfer of\ncases from\nsubordinate\ncourts to\nHigh Court\nDivision\n\n110. If the High Court Division is satisfied that a case pending in a court\nsubordinate to it involves a substantial question of law as to the\ninterpretation of this Constitution, or on a point of general public\nimportance, the determination of which is necessary for the disposal of the\ncase, it shall withdraw the case from that court and may –\n(a) either dispose of the case itself ; or\n(b) determine the question of law and return the case to the court from\nwhich it has been so withdrawn (or transfer it to another subordinate court)\ntogether with a copy of the judgment of the division on such question, and\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nthe court to which the case is so returned or transferred shall, on receipt\nthereof, proceed to dispose of the case in conformity with such judgment.\nBinding\neffect of\nSupreme\nCourt\njudgments\n\n111. The law declared by the Appellate Division shall be binding on the\n\nAction in\naid of\nSupreme\nCourt\n\n112. All authorities, executive and judicial, in the Republic shall act in aid\n\nStaff of\nSupreme\nCourt\n\n113. (1) Appointments of the staff of the Supreme Court shall be made by\n\nHigh Court Division and the law declared by either division of the Supreme\nCourt shall be binding on all courts subordinate to it.\n\nof the Supreme Court.\n\nthe Chief Justice or such other judge or officer of that court as he may\ndirect, and shall be made in accordance with rules made with the previous\napproval of the President by the Supreme Court.\n(2) Subject to the provisions of any Act of Parliament the conditions of\nservice of members of the staff of the Supreme Court shall be such as\nmay be prescribed by rules made by that court.]\n\nCHAPTER II\nSUBORDINATE COURTS\nEstablishment 114. There shall be in addition to the Supreme Court such courts\nof\nsubordinate thereto as may be established by law.\nsubordinate\ncourts\nAppointments 63\n[115. Appointments of persons to offices in the judicial service or as\nto\nmagistrates exercising judicial functions shall be made by the President in\nsubordinate\ncourts\naccordance with rules made by him in that behalf.]\nControl and\ndiscipline\nof\nsubordinate\ncourts\n\n64[116. The control (including the power of posting, promotion and grant of\n\nleave) and discipline of persons employed in the judicial service and\nmagistrates exercising judicial functions shall vest in the President and\nshall be exercised by him in consultation with the Supreme Court.]\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nJudicial\nofficers to\nbe\nindependent\nin the\nexercise of\ntheir\nfunctions\n\n65[116A. Subject to provisions of the Constitution, all persons employed in\n\nthe judicial service and all magistrates shall be independent in the exercise\nof their judicial functions.]\n\nCHAPTER III\nADMINISTRATIVE TRIBUNALS\nAdministrative 117. (1) Notwithstanding anything hereinbefore contained, Parliament may\ntribunals\nby law establish one or more administrative tribunals to exercise\njurisdiction in respect of matters relating to or arising out of –\n(a) the terms and conditions of persons in the service of the Republic,\nincluding the matters provided for in Part IX and the award of penalties or\npunishments;\n(b) the acquisition, administration, management and disposal of any\nproperty vested in or managed by the Government by or under any law,\nincluding the operation and management of, and service in any\nnationalised enterprise or statutory public authority;\n66[(c) any law to which clause (3) of article 102 applies.]\n\n(2) Where any administrative tribunal is established under this article, no\ncourt shall entertain any proceedings or make any order in respect of any\nmatter falling within the jurisdiction of such tribunal:\nProvided that Parliament may, by law, provide for appeals from, or the\nreview of, decisions of any such tribunal.\n\nPART VIA\n[THE NATIONAL PARTY-Omitted]\n[Omitted]\n\nOmitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of\n2011), Section 34.\n\nPART VII\nELECTIONS\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nEstablishment 118. (1) There shall be an Election Commission for Bangladesh consisting\nof Election\nof 67[the Chief Election Commissioner and not more than four Election\nCommission\nCommissioners] and the appointment of the Chief Election Commissioner\nand other Election Commissioners (if any) shall, subject to the provisions\nof any law made in that behalf, be made by the President.\n(2) When the Election Commission consists of more than one person, the\nChief Election Commissioner shall act as the chairman thereof.\n(3) Subject to the provisions of this Constitution the term of office of an\nElection Commissioner shall be five years from the date on which he\nenters upon his office, and –\n(a) a person who has held office as Chief Election Commissioner shall not\nbe eligible for appointment in the service of the Republic;\n(b) any other Election Commissioner shall, on ceasing to hold office as\nsuch, be eligible for appointment as Chief Election Commissioner but shall\nnot be otherwise eligible for appointment in the service of the Republic.\n(4) The Election Commission shall be independent in the exercise of its\nfunctions and subject only to this Constitution and any other law.\n(5) Subject to the provisions of any law made by Parliament, the conditions\nof service of Election Commissioners shall be such as the President may,\nby order, determine:\nProvided that an Election Commissioner shall not be removed from his\noffice except in like manner and on the like grounds as a Judge of the\n68[Supreme Court].\n\n(6) An Election Commissioner may resign his office by writing under his\nhand addressed to the President.\nFunctions\nof Election\nCommission\n\n119. 69[(1) The superintendence, direction and control of the preparation of\nthe electoral rolls for elections to the office of President and to Parliament\nand the conduct of such elections shall vest in the Election Commission\nwhich shall, in accordance with this Constitution and any other law –\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(a) hold elections to the office of President;\n(b) hold elections of members of Parliament;\n(c) delimit the constituencies for the purpose of elections to Parliament ;\nand\n(d) prepare electoral rolls for the purpose of elections to the office of\nPresident and to Parliament.]\n(2) The Election Commission shall perform such functions, in addition to\nthose specified in the foregoing clauses, as may be prescribed by this\nConstitution or by any other law.\nStaff of\nElection\nCommission\n\n120. The President shall, when so requested by the Election Commission,\nmake available to it such staff as may be necessary for the discharge of its\nfunctions under this Part.\n\nSingle\nelectoral\nroll for each\nconstituency\n\n121. There shall be one electoral roll for each constituency for the\n\nQualifications\nfor\nregistration\nas voter\n\n122. (1) The elections 70[* * * ] to Parliament shall be on the basis of adult\n\npurposes of elections to Parliament, and no special electoral roll shall be\nprepared so as to classify electors according to religion, race, caste or sex.\n\nfranchise.\n(2) A person shall be entitled to be enrolled on the electoral roll for a\nconstituency delimited for the purpose of election to the Parliament, if he (a) is a citizen of Bangladesh;\n(b) is not less than eighteen years of age;\n71[(c) does not stand declared by a competent court to be of unsound mind\n\n;\n(d) is or is deemed by law to be a resident of that constituency ; and\n(e) has not been convicted of any offence under the Bangladesh\nCollaborators (Special Tribunals) Order, 1972.]\n72[* * *]\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nTime for\nholding\nelections\n\n123. 73[(1) In the case of a vacancy in the office of President occurring by\nreason of the expiration of his term of office an election to fill the vacancy\nshall be held within the period of ninety to sixty days prior to the date of\nexpiration of the term:\nProvided that if the term expires before the dissolution of the Parliament by\nmembers of which he was elected the election to fill the vacancy shall not\nbe held until after the next general election of members of Parliament, but\nshall be held within thirty days after the first sitting of Parliament following\nsuch general election.\n(2) In the case of a vacancy in the office of President occurring by reason\nof the death, resignation or removal of the President, an election to fill the\nvacancy shall be held within the period of ninety days after the occurrence\nof the vacancy.]\n74[(3) A general election of the members of Parliament shall be held-\n\n(a) in the case of a dissolution by reason of the expiration of its term,\nwithin the period of ninety days preceding such dissolution ; and\n(b) in the case of a dissolution otherwise than by reason of such\nexpiration, within ninety days after such dissolution :\nProvided that the persons elected at a general election under subclause (a) shall not assume office as members of Parliament except after\nthe expiration of the term referred to therein.]\n(4) An election to fill the seat of a member of Parliament which falls vacant\notherwise than by reason of the dissolution of Parliament shall be held\nwithin ninety days of the occurrence of the vacancy 75[:\nProvided that in a case where, in the opinion of the Chief Election\nCommissioner, it is not possible, for reasons of an act of God, to hold such\nelection within the period specified in this clause, such election shall be\nheld within ninety days following next after the last day of such period.]\nParliament\nmay make\nprovision\n\n76[124.\n\nSubject to the provisions of this Constitution, Parliament may by\n\nlaw make provision with respect to all matters relating to or in connection\n\n25/04/2022\n\nas to\nelections\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nwith elections to Parliament, including the delimitation of constituencies,\nthe preparation of electoral rolls, the holding of elections, and all other\nmatters necessary for securing the due Constitution of Parliament.]\n\nValidity of\nelection law\nand\nelections\n\n125. Notwithstanding anything in this Constitution –\n(a) the validity of any law relating to the delimitation of constituencies, or\nthe allotment of seats to such constituencies, made or purporting to be\nmade under article 124, shall not be called in question in any court;\n(b) no election to the 77[office of President 78[* * *]] or to Parliament shall be\ncalled in question except by an election petition presented to such\nauthority and in such manner as may be provided for by or under any law\nmade by Parliament.\n79[(c) A court shall not pass any order or direction, ad interim or otherwise,\n\nin relation to an election for which schedule has been announced, unless\nthe Election Commission has been given reasonable notice and an\nopportunity of being heard.]\nExecutive\nauthorities\nto assist\nElection\nCommission\n\n126. It shall be the duty of all executive authorities to assist the Election\nCommission in the discharge of its functions.\n\nPART VIII\nTHE COMPTROLLER AND AUDITOR GENERAL\nEstablishment 127. (1) There shall be a Comptroller and Auditor General of Bangladesh\nof office of\n(hereinafter referred to as the Auditor General) who shall be appointed by\nAuditorGeneral\nthe President.\n(2) Subject to the provisions of this Constitution and of any law made by\nParliament, the conditions of service of the Auditor General shall be such\nas the President may, by order, determine.\nFunctions\nof AuditorGeneral\n\n128. (1) The public accounts of the Republic and of all courts of law and all\nauthorities and officers of the Government shall be audited and reported\non by the Auditor General and for that purpose he or any person\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nauthorised by him in that behalf shall have access to all records, books,\nvouchers,\n\ndocuments,\n\ncash,\n\nstamps,\n\nsecurities,\n\nstores\n\nor\n\nother\n\ngovernment property in the possession of any person in the service of the\nRepublic.\n(2) Without prejudice to the provisions of clause (1), if it is prescribed by\nlaw in the case of any body corporate directly established by law, the\naccounts of that body corporate shall be audited and reported on by such\nperson as may be so prescribed.\n(3) Parliament may by law require the Auditor General to exercise such\nfunctions, in addition to those specified in clause (1), as such law may\nprescribe, and until provision is made by law under this clause the\nPresident may, by order, make such provision.\n(4) The Auditor General, in the exercise of his functions under clause (1),\nshall not be subject to the direction or control of any other person or\nauthority.\nTerm of\noffice of\nAuditorGeneral\n\n129. 80[(1) The Auditor-General shall, subject to the provisions of this\narticle, hold office for five years from the date on which he entered upon\nhis office, or until he attains the age of sixty-five years, whichever is\nearlier.]\n(2) The Auditor General shall not be removed from his office except in like\nmanner and on the like grounds as a Judge of the 81[Supreme Court].\n(3) The Auditor General may resign his office by writing under his hand\naddressed to the President.\n(4) On ceasing to hold office the Auditor General shall not be eligible for\nfurther office in the service of the Republic.\n\nActing\nAuditorGeneral\n\n130. At any time when the office of Auditor General is vacant, or the\nPresident is satisfied that the Auditor General is unable to perform his\nfunctions on account of absence, illness or any other cause, the President\nmay appoint a person to act as Auditor General and to perform the\nfunctions of that office until an appointment is made under article 127 or,\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nas the case may be, until the Auditor General resumes the functions of his\noffice.\nForm and\nmanner of\nkeeping\npublic\naccounts\n\n131. The public accounts of the Republic shall be kept in such form and in\n\nReports of\nAuditor\nGeneral to\nbe laid\nbefore\nParliament\n\n132. The reports of the Auditor General relating to the public accounts of\n\nsuch manner as the Auditor General may, with the approval of the\nPresident, prescribe.\n\nthe Republic shall be submitted to the President, who shall cause them to\nbe laid before Parliament.\n\nPART IX\nTHE SERVICES OF BANGLADESH\n\nCHAPTER I\nSERVICES\nAppointment\nand\nconditions\nof service\n\n133. Subject to the provisions of this Constitution Parliament may by law\nregulate the appointment and conditions of service of persons in the\nservice of the Republic:\nProvided that it shall be competent for the President to make rules\nregulating the appointment and the conditions of service of such persons\nuntil provision in that behalf is made by or under any law, and rules so\nmade shall have effect subject to the provisions of any such law.\n\nTenure of\noffice\n\n134. Except as otherwise provided by this Constitution every person in the\nservice of the Republic shall hold office during the pleasure of the\nPresident.\n\nDismissal,\netc. of\ncivilian\npublic\nofficers\n\n135. (1) No person who holds any civil post in the service of the Republic\nshall be dismissed or removed or reduced in rank by an authority\nsubordinate to that by which he was appointed.\n(2) No such person shall be dismissed or removed or reduced in rank until\nhe has been given a reasonable opportunity of showing cause why that\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\naction should not be taken:\n\nProvided that this clause shall not apply –\n(i) where a person is dismissed or removed or reduced in rank on the\nground of conduct which has led to his conviction of a criminal offence; or\n(ii) where the authority empowered to dismiss or remove a person or to\nreduce him in rank is satisfied that, for a reason recorded by that authority\nin writing, it is not reasonably practicable to give that person an opportunity\nof showing cause; or\n(iii) where the President is satisfied that in the interests of the security of\nthe State it is not expedient to give that person such an opportunity.\n(3) If in respect of such a person the question arises whether it is\nreasonably practicable to give him an opportunity to show cause in\naccordance with clause (2), the decision thereon of the authority\nempowered to dismiss or remove such person or to reduce him in rank\nshall be final.\n(4) Where a person is employed in the service of the Republic under a\nwritten contract and that contract is terminated by due notice in\naccordance with its terms, he shall not, by reason thereof, be regarded as\nremoved from office for the purposes of this article.\nReorganisation 136. Provision may be made by law for the reorganisation of the service of\nof service\nthe Republic by the creation, amalgamation or unification of services and\nsuch law may vary or revoke any condition of service of a person\nemployed in the service of the Republic.\n\nCHAPTER II\nPUBLIC SERVICE COMMISSIONS\nEstablishment 137. Provision shall be made by law for establishing one or more public\nof\nservice commissions for Bangladesh, each of which shall consist of a\ncommissions\nchairman and such other members as shall be prescribed by law.\nAppointment\nof members\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n138. (1) The chairman and other members of each public service\ncommission shall be appointed by the President:\nProvided that not less than one half of the members of a commission shall\nbe persons who have held office for twenty years or more in the service of\nany government which has at any time functioned within the territory of\nBangladesh.\n(2) Subject to any law made by Parliament the conditions of service of the\nchairman and other members of a public service commission shall be such\nas the President may, by order, determine.\nTerm of\noffice\n\n139. (1) The term of office of the chairman and other members of a public\nservice commission shall, subject to the provisions of this article, expire\nfive years after the date on which he entered upon his office, or when he\nattains the age of 82[sixty five] years, whichever is earlier.\n(2) The chairman and other members of such a commission shall not be\nremoved from office except in like manner and on the like grounds as a\nJudge of the 83[Supreme Court].\n(3) A chairman or other member of a public service commission may\nresign his office by writing under his hand addressed to the President.\n(4) On ceasing to hold office a member of a public service commission\nshall not be eligible for further employment in the service of the Republic,\nbut, subject to the provisions of clause (1)(a) a chairman so ceasing shall be eligible for re appointment for one\nfurther term; and\n(b) a member (other than the chairman) so ceasing shall be eligible for re\nappointment for one further term or for appointment as chairman of a\npublic service commission.\n\nFunctions\nof\ncommissions\n\n140. (1) The functions of a public service commission shall be –\n(a) to conduct tests and examinations for the selection of suitable persons\nfor appointment to the service of the Republic;\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(b) to advise the President on any matter on which the commission is\nconsulted under clause (2) or on any matter connected with its functions\nwhich is referred to the commission by the President; and\n(c) such other functions as may be prescribed by law.\n(2) Subject to the provisions of any law made by Parliament, and any\nregulation (not inconsistent with such law) which may be made by the\nPresident after consultation with a commission, the President shall consult\na commission with respect to –\n(a) matters relating to qualifications for, and methods of recruitment to, the\nservice of the Republic;\n(b) the principles to be followed in making appointments to that service\nand promotions and transfers from one branch of the service to another,\nand the suitability of candidates for such appointments, promotions and\ntransfers;\n(c) matters affecting the terms and conditions (including pension rights) of\nthat service; and\n(d) the discipline of the service.\nAnnual\nreport\n\n141. (1) Each commission shall, not later than the first day of March each\nyear, prepare and submit to the President a report on the performance of\nits functions during the period ended on the previous 31st day of\nDecember.\n(2) The report shall be accompanied by a memorandum setting out, so far\nas is known to the commission(a) the cases, if any, in which its advice was not accepted and the reasons\nwhy it was not accepted;\n(b) the cases where the commission ought to have been consulted and\nwas not consulted, and the reasons why it was not consulted.\n(3) The President shall cause the report and memorandum to be laid\nbefore Parliament at its first meeting held after 31st March in the year in\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nwhich the report was submitted.\n\nPART IXA\n\n84\n\nEMERGENCY PROVISIONS\nProclamation\nof\nemergency\n\n141A. (1) If the President is satisfied that a grave emergency exists in\nwhich the security or economic life of Bangladesh, or any part thereof, is\nthreatened by war or external aggression or internal disturbance, he may\nissue a Proclamation of Emergency 85[for one hundred twenty days]:\n86[* * *]\n87[Provided\n\nthat such Proclamation shall require for its validity the prior\n\ncounter signature of the Prime Minister.]\n(2) A Proclamation of Emergency –\n(a) may be revoked by a subsequent Proclamation;\n(b) shall be laid before Parliament;\n(c) shall cease to operate at the expiration of one hundred and twenty\ndays, unless before the expiration of that period it has been approved by a\nresolution of Parliament: 88[* * *]\nProvided that if any such Proclamation is issued at a time when Parliament\nstands dissolved or the dissolution of Parliament takes place during the\nperiod of one hundred and twenty days referred to in sub clause (c), the\nProclamation shall cease to operate at the expiration of thirty days from\nthe date on which Parliament first meets after its re constitution, unless\nbefore that expiration of the said period of thirty days a resolution\napproving the Proclamation has been passed by Parliament 89[or at the\nexpiration of one hundred and twenty days, whichever occurs first.].\n(3) A Proclamation of Emergency declaring that the security of\nBangladesh, or any part thereof, is threatened by war or external\naggression or by internal disturbance may be made before the actual\noccurrence of war or any such aggression or disturbance if the President\nis satisfied that there is imminent danger thereof.\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nSuspension\nof\nprovisions\nof certain\narticles\nduring\nemergencies\n\n141B. While a Proclamation of Emergency is in operation, nothing in\narticles 36, 37, 38, 39, 40 and 42 shall restrict the power of the State to\nmake any law or to take any executive action which the State would, but\nfor the provisions contained in Part III of this Constitution, be competent to\nmake or to take, but any law so made shall, to the extent of the\nincompetency, cease to have effect as soon as the Proclamation ceases to\noperate, except as respects things done or omitted to be done before the\nlaw so ceases to have effect.\n\nSuspension\nof\nenforcement\nof\nfundamental\nrights\nduring\nemergencies\n\n141C. (1) While a Proclamation of Emergency is in operation, the\nPresident may, 90[on the written advice of the Prime Minister, by order],\ndeclare that the right to move any court for the enforcement of such of the\nrights conferred by Part III of this Constitution as may be specified in the\norder, and all proceedings pending in any court for the enforcement of the\nright so specified, shall remain suspended for the period during which the\nProclamation is in force or for such shorter period as may be specified in\nthe order.\n(2) An order made under this article may extend to the whole of\nBangladesh or any part thereof.\n(3) Every order made under this article shall, as soon as may be, be laid\nbefore Parliament.]\n\nPART X\nAMENDMENT OF THE CONSTITUTION\nPower to\namend any\nprovision of\nthe\nConstitution\n\n91[142. Notwithstanding anything contained in this Constitution-\n\n(a) any provision thereof may be amended by way of addition, alteration,\nsubstitution or repeal by Act of Parliament :\nProvided that(i) no Bill for such amendment shall be allowed to proceed unless the long\ntitle thereof expressly states that it will amend a provision of the\nConstitution;\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(ii) no such Bill shall be presented to the President for assent unless it is\npassed by the votes of not less than two thirds of the total number of\nmembers of Parliament ;\n(b) when a Bill passed as aforesaid is presented to the President for\nhis assent he shall, within the period of seven days after the Bill is\npresented to him assent to the Bill, and if he fails so to do he shall be\ndeemed to have assented to it on the expiration of that period.]\n\nPART XI\nMISCELLANEOUS\nProperty of\nthe\nRepublic\n\n143. (1) There shall vest in the Republic, in addition to any other land or\nproperty lawfully vested –\n(a) all minerals and other things of value underlying any land of\nBangladesh;\n(b) all lands, minerals and other things of value underlying the ocean\nwithin the territorial waters, or the ocean over the continental shelf, of\nBangladesh; and\n(c) any property located in Bangladesh that has no rightful owner.\n(2) Parliament may from time to time by law provide for the determination\nof the boundaries of the territory of Bangladesh and of the territorial waters\nand the continental shelf of Bangladesh.\n\nExecutive\nauthority in\nrelation to\nproperty,\ntrade, etc.\n\n144. The executive authority of the Republic shall extend to the\n\nContracts\nand deeds\n\n145. (1) All contracts and deeds made in exercise of the executive\n\nacquisition, sale, transfer, mortgage and disposal of property, the carrying\non of any trade or business and the making of any contract.\n\nauthority of the Republic shall be expressed to be made by the President,\nand shall be executed on behalf of the President by such person and in\nsuch manner as he may direct or authorise.\n(2) Where a contract or deed is made or executed in exercise of the\nexecutive authority of the Republic, neither the President nor any other\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nperson making or executing the contract or deed in exercise of that\nauthority shall be personally liable in respect thereof, but this article shall\nnot prejudice the right of any person to take proceedings against the\nGovernment.\nInternational\ntreaties\n\n92[145A.\n\nAll treaties with foreign countries shall be submitted to the\n\nPresident, who shall cause them to be laid before Parliament :\nProvided that any such treaty connected with national security shall be\nlaid in a secret session of Parliament.]\n\nSuits in\nname of\nBangladesh\n\n146. The Government of Bangladesh may sue or be sued by the name of\nBangladesh.\n\nRemuneration,\n147. (1) The remuneration, privileges and other terms and conditions of\netc., of\nservice of a person holding or acting in any office to which this article\ncertain\nofficers\n\napplies shall be determined by or under Act of Parliament, but until they\nare so determined (a) they shall be those (if any) appertaining to the person holding or, as the\ncase may be, acting in the office in question immediately before the\ncommencement of this Constitution; or\n(b) if the preceding sub clause is not applicable, they shall be determined\nby order made by the President.\n(2) The remuneration, privileges and other terms and conditions of service\nof a person holding or acting in any office to which this article applies shall\nnot be varied to the disadvantage of any such person during his term of\noffice.\n(3) No person appointed to or acting in any office to which this article\napplies shall hold any office, post or position of profit or emolument or take\nany part whatsoever in the management or conduct of any company,\nassociation or body having profit or gain as its object:\nProvided that such person shall not for the purposes of this clause be\ndeemed to hold any such office, post or position by reason only that he\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nholds or is acting in the office first above mentioned.\n(4) This article applies to the offices of –\n(a) President;\n93[* * *]\n94[(b) Prime Minister;]\n\n(c) Speaker or Deputy Speaker;\n95[(d) Minister, Minister of State or Deputy Minister;]\n\n(e) Judge of the Supreme Court;\n(f) Comptroller and Auditor General;\n(g) Election Commissioner;\n(h) Member of a public service commission.\nOaths of\noffice\n\n148. (1) A person elected or appointed to any office mentioned in the Third\nSchedule shall before entering upon the office make and subscribe an\noath or affirmation (in this article referred to as “an oath”) in accordance\nwith that Schedule.\n96[* * *]\n\n(2) Where under this Constitution an oath is required to be administered by\na specified person 97[* * *], it may be administered by such other person\nand at such place as may be designated by that person.\n98[(2A) If, within three days next after publication through official Gazette of\n\nthe result of a general election of members of Parliament under clause (3)\nof article 123, the person specified under the Constitution for the purpose\nor such other person designated by that person for the purpose, is unable\nto, or does not, administer oath to the newly elected members of\nParliament, on any account, the Chief Election Commissioner shall\nadminister such oath within three days next thereafter, as if, he is the\nperson specified under the Constitution for the purpose.]\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(3) Where under this Constitution a person is required to make an oath\nbefore he enters upon an office he shall be deemed to have entered upon\nthe office immediately after he makes the oath.\nSaving for\nexisting\nlaws\n\n149. Subject to the provisions of this Constitution all existing laws shall\ncontinue to have effect but may be amended or repealed by law made\nunder this Constitution.\n\nTransitional\nand\ntemporary\nprovisions\n\n99[150.\n\n(1) The provisions set out in the Fourth Schedule of the\n\nConstitution at the time of the Commencement of this Constitution on the\n16th day of December, 1972 shall have effect as transitional and\ntemporary provisions notwithstanding anything contained in any other\nprovisions of this Constitution.\n(2) In the period between the 7th day of March, 1971 and the date of\ncommencement of this Constitution on the 16th day of December, 1972,\nthe historical speech delivered by Bangabandhu Sheikh Mujibur Rahman,\nthe Father of the Nation, in the Racecourse Maidan, Dhaka on the 7th day\nof March, 1971, set out in the Fifth Schedule of the Constitution, the\ntelegram of the Declaration of Independence of Bangladesh made by\nBangabandhu Sheikh Mujibur Rahman, the Father of the Nation on the\n26th day of March, 1971 set out in the Sixth Schedule and the\nProclamation of Independence of the Mujibnagar Government on the 10th\nday of April, 1971 set out in the Seventh Schedule are the historical\nspeech and instruments of the independence and the struggle of freedom\nof Bangladesh which shall be deemed to be the transitional and the\ntemporary provision for the said period.]\n\nRepeals\n\n151. The following President's Orders are hereby repealed–\n(a) The Laws Continuance Enforcement Order, made on 10th April, 1971;\n(b) The Provisional Constitution of Bangladesh Order, 1972;\n(c) The High Court of Bangladesh Order, 1972 (P.O. No. 5 of 1972);\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n(d) The Bangladesh Comptroller and Auditor General Order, 1972 (P.O.\nNo. 15 of 1972);\n(e) The Constituent Assembly of Bangladesh Order, 1972 (P.O. No. 22 of\n1972);\n(f) The Bangladesh Election Commission Order, 1972 (P.O. No. 25 of\n1972);\n(g) The Bangladesh Public Service Commissions Order, 1972 (P.O. No. 34\nof 1972);\n(h) The Bangladesh Transaction of Government Business Order, 1972\n(P.O. No. 58 of 1972).\nInterpretation\n\n152. (1) In this Constitution, except where the subject or context otherwise\nrequires –\n“administrative unit” means a district or other area designated by law for\nthe purposes of article 59;\n100[* * *]\n101[\"the Appellate Division\" means the Appellate Division of the Supreme\n\nCourt;]\n“article” means an article of this Constitution;\n“borrowing” includes the raising of money by annuity, and “loan” shall be\nconstrued accordingly;\n“the capital” has the meaning assigned to that expression in article 5;\n102[* * *]\n\n“Chief Election Commissioner” means a person appointed to that office\nunder article 118;\n103[“The Chief Justice” means the Chief Justice of Bangladesh;]\n\n“citizen” means a person who is a citizen of Bangladesh according to the\nlaw relating to citizenship;\n“clause” means a clause of the article in which the expression occurs;\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n104[“court” means any court of law including Supreme Court;]\n\n“debt” includes any liability in respect of any obligation to repay capital\nsums by way of annuities and any liability under any guarantee, and “debt\ncharge” shall be construed accordingly;\n“disciplinary law” means a law regulating the discipline of any disciplined\nforce;\n“disciplined force” means –\n(a) the army, navy or air force;\n(b) the police force;\n(c) any other force declared by law to be a disciplined force within the\nmeaning of this definition;\n“district judge” includes additional district judge;\n“existing law” means any law in force in, or in any part of, the territory of\nBangladesh immediately before the commencement of this Constitution,\nwhether or not it has been brought into operation;\n“financial year” means a year commencing on the first day of July;\n“guarantee” includes any obligation undertaken before the commencement\nof this Constitution to make payments in the event of the profits of an\nundertaking falling short of a specified amount;\n“the High Court Division” means the High Court Division of the Supreme\nCourt;\n“judge” means a judge of a division of the Supreme Court;\n“judicial service” means a service comprising persons holding judicial\nposts not being posts superior to that of a district judge;\n“law” means any Act, ordinance, order, rule, regulation, bye law,\nnotification or other legal instrument, and any custom or usage, having the\nforce of law in Bangladesh;\n“Parliament” means the Parliament for Bangladesh established by article\n65;\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n“Part” means a Part of this Constitution;\n“pension” means a pension, whether contributory or not, of any kind\nwhatsoever payable to or in respect of any person, and includes retired\npay or gratuity so payable by way of the return or any addition thereto of\nsubscriptions to a provident fund;\n“political party” includes a group or combination of persons who operate\nwithin or outside Parliament under a distinctive name and who hold\nthemselves out for the purpose of propagating a political opinion or\nengaging in any other political activity;\n“the President” means the President of Bangladesh elected under this\nConstitution or any person for the time being acting in that office;\n“property” includes property of every description movable or immovable,\ncorporeal or incorporeal, and commercial and industrial undertakings, and\nany right or interest in any such property or undertaking;\n“public notification” means a notification in the Bangladesh Gazette;\n“public officer” means a person holding or acting in any office of\nemolument in the service of the Republic;\n“the Republic” means the People's Republic of Bangladesh;\n“Schedule” means a schedule to this Constitution;\n“securities” includes stock;\n“the service of the Republic” means any service, post or office whether in a\ncivil or military capacity, in respect of the Government of Bangladesh, and\nany other service declared by law to be a service of the Republic;\n“session”, in relation to Parliament, means the sittings of Parliament\ncommencing when it first meets after the commencement of this\nConstitution or after a prorogation or dissolution of Parliament and\nterminating when Parliament is prorogued or dissolved;\n“sitting”, in relation to Parliament, means a period during which Parliament\nis sitting continuously without adjournment;\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n“the Speaker” means the person for the time being holding the office of\nSpeaker pursuant to article 74;\n“the State” includes Parliament, the Government and statutory public\nauthorities;\n“statutory public authority” means any authority, corporation or body the\nactivities or the principal activities of which are authorised by any Act,\nordinance, order or instrument having the force of law in Bangladesh;\n“sub clause” means a sub clause of the clause in which the expression\noccurs;\n“the Supreme Court” means the Supreme Court of Bangladesh constituted\nby article 94;\n“taxation” includes the imposition of any tax, rate, duty or impost, whether\ngeneral, local or special, and “Tax” shall be construed accordingly 105[;]\n106[* * *]\n\n(2) The General Clauses Act, 1897 shall apply in relation to –\n(a) this Constitution as it applies in relation to an Act of Parliament;\n(b) any enactment repealed by this Constitution, or which by virtue thereof\nbecomes void or ceases to have effect, as it applies in relation to any\nenactment repealed by Act of Parliament.\nCommencement,153. (1) This Constitution may be cited as the Constitution of the People's\ncitation and\nRepublic of Bangladesh and shall come into force on the sixteenth day of\nauthenticity\nDecember, 1972, in this Constitution referred to as the commencement of\nthis Constitution.\n(2) There shall be an authentic text of this Constitution in Bengali, and an\nauthentic text of an authorised translation in English, both of which shall be\ncertified as such by the Speaker of the Constituent Assembly.\n(3) A text certified in accordance which clause (2) shall be conclusive\nevidence of the provisions of this Constitution:\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\nProvided that in the event of conflict between the Bengali and the English\ntext, the Bengali text shall prevail.\n\n1 Substituted for the words, commas, signs and brackets \"BISMILLAH-AR-RAHMAN-AR-RAHIM (In the name of Allah, the\n\nBeneficent, the Merciful)\" by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 2.\n2 Substituted for the words \"a historic war for national independence\" by the Constitution (Fifteenth Amendment) Act, 2011\n\n(Act XIV of 2011), section 3.\n3 Substituted for the former second paragraph by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 3.\n4 Substituted for the semi-colon and word \";and\" by the Constitution (Third Amendment) Act, 1974 (Act LXXIV of 1974),\n\nsection 3. But its effectiveness is subject to gazette notification under section 4 of that Act.\n5",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Preamble",
        "article_number": "Preamble",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 2A was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011) section 4.\n6 Substituted for the word \"Bengali\" by the Constitution (Eighth Amendment) Act, 1988 (Act XXX of 1988), section 3.\n7",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 2A",
        "article_number": "2A",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 4A was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011) section 5.\n8 The word “Dhaka” was substituted for the word “Dacca” by section 4 of the Constitution (Eighth Amendment) Act, 1988\n\n(Act No. XXX of 1988)\n9",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 4A",
        "article_number": "4A",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 6 was substituted for the formar article 6 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 6.\n10",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 6",
        "article_number": "6",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 7A and 7B were inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 7.\n11 Substituted for the former clause (1) and (1A) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 8.\n12 Substituted for the former article 9 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 9.\n13 Substituted for the former article 10 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011) section 10.\n14 The comma and words \",and in which effective participation by the people through their elected representatives in\n\nadministration at all levels shall be ensured\" were omitted by the Constitution (Fourth Amendment) Act, 1975 (Act II of\n1975), section 2.\n15 The Comma and words \", and in which effective participation by the people through their elected representatives in\n\nadministration at all levels shall be ensured\" were inserted by the Constitution (Twelfth Amendment) Act, 1991 (Act XXVIII\nof 1991), section 2.\n16 Substituted for the former article 12 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 11.\n17",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 7A",
        "article_number": "7A",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 18A was inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 12.\n18 Clause (3) was added by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 13.\n19",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 18A",
        "article_number": "18A",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 23A was inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 14.\n20 The figure and brackets (1) were omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 15, (i).\n21 Clause (2) was omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 15, (ii).\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n22 Clause (3) was added by section 2 of the Constitution (Second Amendment) Act, 1973 (Act No. XXIV of 1973)\n23",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 23A",
        "article_number": "23A",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 30 was substituted by section 5 of the Constitution (Eighth Amendment) Act, 1988 (Act No. XXX of 1988)\n24",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 30",
        "article_number": "30",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 33 was substituted by section 3 of the Constitution (Second Amendment) Act, 1973 (Act No. XXIV of 1973)\n25",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 33",
        "article_number": "33",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 38 was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 16.\n26 Substituted for the former clause (2) and (3) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 17.\n27 Substituted for the former article 44 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 18.\n28 Substituted for the proviso by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 19 (i).\n29 Clause (3) was added by section 2 of the Constitution (First Amendment) Act, 1973 (Act No. XV of 1973)\n30 Inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 19 (ii).\n31",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 38",
        "article_number": "38",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 47A was inserted by section 3 of the Constitution (First Amendment) Act, 1973 (Act No. XV of 1973)\n32 Chapters I, II and III were substituted for Chapters I and II by section 3 of the Constitution (Twelfth Amendment) Act,\n\n1991 (Act No. XXVIII of 1991).\n33",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 47A",
        "article_number": "47A",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 58A was omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 20.\n34",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 58A",
        "article_number": "58A",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 61 was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 22.\n35 Clauses (2) and (3) were omitted by section 4 of the Constitution (Second Amendment) Act, 1973 (Act No. XXIV of\n\n1973)\n36 Clause (3) was substituted by section 2 of The Constitution (Seventeenth Amendment) Act, 2018 (Act No 29 0f 2018).\n37 Clause (3A) was inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 23 (ii).\n38 The word \"or\" and sub-clause (dd) were omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 24 (i).\n39 Sub-clause (e) and (f) were inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 24\n\n(ii).\n40 Clause (2A) was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 24 (iii).\n41 Clause (3) was inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 24 (iv).\n42 The words “before Parliament” were omitted by section 5 of the Constitution (Fourth Amendment) Act, 1975 (Act No. II\n\nof 1975)\n43 The word “remuneration” was substituted for the word “salaries” by section 6 of the Constitution (Eighth Amendment)\n\nAct, 1988 (Act No. XXX of 1988)\n44 Substituted for the former article 70 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 25.\n45 The proviso was substituted by section 6 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n46 Inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 26.\n47 Clause (4A) was omitted by section 6 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n48",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 61",
        "article_number": "61",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 73A was inserted by section 9 of the Constitution (Fourth Amendment) Act, 1975 (Act No. II of 1975)\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n49 The words “or to speak on any matter not related to his Ministry” were inserted by section 7 of the Constitution (Twelfth\n\nAmendment) Act, 1991 (Act No. XXVIII of 1991)\n50 The words “Deputy Prime Minister” were omitted by the Constitution (Twelfth Amendment) Act, 1991 (Act XXVIII of\n\n1991), section 7(b).\n51 The words “acting as” were substituted for the words “exercising the functions of the” by section 10 of the Constitution\n\n(Fourth Amendment) Act, 1975 (Act No. II of 1975)\n52 The words “At its first meeting in each session” were omitted by section 11 of the Constitution (Fourth Amendment) Act,\n\n1975 (Act No. II of 1975)\n53 Clause (3) was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 27 (i).\n54 The words “by the votes of a majority of the total number of members of Parliament\" were omitted by the Constitution\n\n(Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 27 (ii).\n55 The words \"in any Money Bill\" were inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 28.\n56 Clause (aa) was omitted by section 8 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n57 Sub-para (ii) was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 29(a).\n58 Para (c) was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 29 (b).\n59 Clause (3) was added by section 9 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n60 Substituted for the words \"Parliament stands dissolved or is not in session\" by the Constitution (Fifteenth Amendment)\n\nAct, 2011 (Act XIV of 2011), section 30.\n61 Substituted for the former Chapter I by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 31.\n62 Clauses (2), (3) and (4) were substituted for the clauses (2), (3), (4), (5), (6), (7) and (8) by section 2 of the Constitution\n\n(Sixteenth Amendment) Act, 2014 (Act No. XIII of 2014).\n63",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 73A",
        "article_number": "73A",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 115 was substituted by section 19 the Constitution (Fourth Amendment) Act, 1975 (Act No. II of 1975)\n64 Substituted for the former article 116 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 32.\n65",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 115",
        "article_number": "115",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 116A was inserted by section 21 of the Constitution (Fourth Amendment) Act, 1975 (Act No. II of 1975)\n66 Substituted for the former sub-clause (c) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),section\n\n33.\n67 Substituted for the words and commas \"a Chief Election Commissioner and such number of other Election\n\nCommissoners if any, as the President may from time to time direct,\" by the Constitution (Fifteenth amendment) Act, 2011\n(Act XIV of 2011), section 35 (a).\n68 Substituted for the words \"Supreme Court\" by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 35 (b).\n69 Clause (1) was substituted by section 12 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIll of 1991)\n70 The words “to the offices of President and Vice President and” were omitted by section 13 of the Constitution (Twelfth\n\nAmendment) Act, 1991 (Act No. XXVIII of 1991)\n71 Substituted for sub-clauses (c) and (d) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section\n\n36.\n72 Clause (3) was omitted by section 13 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n73 Clauses (1) and (2) were substituted for clauses (1), (2), (2A) and (2B) by section 14 of the Constitution (Twelfth\n\nAmendment) Act, 1991 (Act No. XXVIII of 1991)\n74 Substituted for the former clause (3) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 37.\n75 The colon (:) was substituted for the full stop (.) and thereafter the proviso was added by section 14 of the Constitution\n\n(Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n76",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 116A",
        "article_number": "116A",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 124 was substituted by section 15 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n77 The words “offices of President and Vice President” were substituted for the words “office of President” by section 14 of\n\nthe Constitution (Ninth Amendment) Act. 1989 (Act No. XXXVIII of 1989)\n78 The words “and Vice President” were omitted by section 16 of the Constitution (Twelfth Amendment) Act, 1991 (Act No.\n\nXXVIII of 1991)\n79 Clause (c) was added by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 38.\n80 Clause (1) was substituted by section 5 of the Constitution (Fourteenth Amendment) Act, 2004 (Act No. XIV of 2004)\n81 Substituted for the words \"Supreme Court\" by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 39.\n82 The words “sixty five” were substituted for the words “sixty-two” by section 6 of the Constitution (Fourteenth\n\nAmendment) Act, 2004 (Act No. XIV of 2004)\n83 Substituted for the words “Supreme Court” by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 40.\n84 Part IXA was inserted by section 6 of the Constitution (Second Amendment) Act, 1973 (Act No. XXIV of 1973).\n85 The words \" for one hundred twenty days\" were added by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of\n\n2011), section 41 (a).\n86 The proviso was omitted by section 28 of the Constitution (Fourth Amendment) Act, 1975 (Act No. II of 1975)\n87 The proviso was added by section 17 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n88 Omitted by the Constitution (Fifteenth Amendment ) Act, 2011 (Act XIV of 2011), section 41 (b).\n89 Added by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 41 (c).\n90 The words and comma “on the written advice of the Prime Minister, by order” were substituted for the words “by order”\n\nby section 18 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n91",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 124",
        "article_number": "124",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 142 was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 42.\n92",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 142",
        "article_number": "142",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 145A was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 43.\n93 Sub clause (aa) was omitted by section 21 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n94 Substituted for the former sub-clause (b) by the Constitution (Fifteenth Amendment) Act, 2011 (Act No. XIV of 2011)\n\nsection 44(i).\n95 Substituted for the former sub-clause (d) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section\n\n44(ii).\n96 Clause (IA) was omitted by section 22 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n97 The words “and for any reason it is impracticable for the oath to be made before that person” were omitted by section\n\n30 of the Constitution (Fourth Amendment) Act, 1975 (Act No. II of 1975)\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n98 Clause (2A) was inserted by section 7 of the Constitution (Fourteenth Amendment) Act, 2004 (Act No. XIV of 2004)\n99",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 145A",
        "article_number": "145A",
        "type": "constitutional_article"
      }
    },
    {
      "page_content": "Article 150 was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 45.\n100 Omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV 2011), section 46 (a).\n101 Substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 46(b)\n102 Omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 46(d).\n103 Inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 46(b).\n104 Inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 46(c).\n105 The semi-colon (;) was substituted for the full stop (.) by section 16 of the Constitution (Ninth Amendment) Act, 1989\n\n(Act No. XXXVIII of 1989)\n106 The expression “the vice president” was omitted by section 23 of the Constitution (Twelfth Amendment) Act, 1991 (Act\n\nNo. XXVIII of 1991)\n\nCopyright © 2019, Legislative and Parliamentary Affairs Division\nMinistry of Law, Justice and Parliamentary Affairs",
      "metadata": {
        "source": "Bangladesh Constitution",
        "article": "Article 150",
        "article_number": "150",
        "type": "constitutional_article"
      }
    }
  ],
  "article_index": {
    "2A": "Article 2A was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011) section 4.\n6 Substituted for the word \"Bengali\" by the Constitution (Eighth Amendment) Act, 1988 (Act XXX of 1988), section 3.\n7",
    "4A": "Article 4A was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011) section 5.\n8 The word “Dhaka” was substituted for the word “Dacca” by section 4 of the Constitution (Eighth Amendment) Act, 1988\n\n(Act No. XXX of 1988)\n9",
    "6": "Article 6 was substituted for the formar article 6 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 6.\n10",
    "7A": "Article 7A and 7B were inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 7.\n11 Substituted for the former clause (1) and (1A) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 8.\n12 Substituted for the former article 9 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 9.\n13 Substituted for the former article 10 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011) section 10.\n14 The comma and words \",and in which effective participation by the people through their elected representatives in\n\nadministration at all levels shall be ensured\" were omitted by the Constitution (Fourth Amendment) Act, 1975 (Act II of\n1975), section 2.\n15 The Comma and words \", and in which effective participation by the people through their elected representatives in\n\nadministration at all levels shall be ensured\" were inserted by the Constitution (Twelfth Amendment) Act, 1991 (Act XXVIII\nof 1991), section 2.\n16 Substituted for the former article 12 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 11.\n17",
    "18A": "Article 18A was inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 12.\n18 Clause (3) was added by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 13.\n19",
    "23A": "Article 23A was inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 14.\n20 The figure and brackets (1) were omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 15, (i).\n21 Clause (2) was omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 15, (ii).\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n22 Clause (3) was added by section 2 of the Constitution (Second Amendment) Act, 1973 (Act No. XXIV of 1973)\n23",
    "30": "Article 30 was substituted by section 5 of the Constitution (Eighth Amendment) Act, 1988 (Act No. XXX of 1988)\n24",
    "33": "Article 33 was substituted by section 3 of the Constitution (Second Amendment) Act, 1973 (Act No. XXIV of 1973)\n25",
    "38": "Article 38 was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 16.\n26 Substituted for the former clause (2) and (3) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 17.\n27 Substituted for the former article 44 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 18.\n28 Substituted for the proviso by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 19 (i).\n29 Clause (3) was added by section 2 of the Constitution (First Amendment) Act, 1973 (Act No. XV of 1973)\n30 Inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 19 (ii).\n31",
    "47A": "Article 47A was inserted by section 3 of the Constitution (First Amendment) Act, 1973 (Act No. XV of 1973)\n32 Chapters I, II and III were substituted for Chapters I and II by section 3 of the Constitution (Twelfth Amendment) Act,\n\n1991 (Act No. XXVIII of 1991).\n33",
    "58A": "Article 58A was omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 20.\n34",
    "61": "Article 61 was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 22.\n35 Clauses (2) and (3) were omitted by section 4 of the Constitution (Second Amendment) Act, 1973 (Act No. XXIV of\n\n1973)\n36 Clause (3) was substituted by section 2 of The Constitution (Seventeenth Amendment) Act, 2018 (Act No 29 0f 2018).\n37 Clause (3A) was inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 23 (ii).\n38 The word \"or\" and sub-clause (dd) were omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 24 (i).\n39 Sub-clause (e) and (f) were inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 24\n\n(ii).\n40 Clause (2A) was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 24 (iii).\n41 Clause (3) was inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 24 (iv).\n42 The words “before Parliament” were omitted by section 5 of the Constitution (Fourth Amendment) Act, 1975 (Act No. II\n\nof 1975)\n43 The word “remuneration” was substituted for the word “salaries” by section 6 of the Constitution (Eighth Amendment)\n\nAct, 1988 (Act No. XXX of 1988)\n44 Substituted for the former article 70 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 25.\n45 The proviso was substituted by section 6 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n46 Inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 26.\n47 Clause (4A) was omitted by section 6 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n48",
    "73A": "Article 73A was inserted by section 9 of the Constitution (Fourth Amendment) Act, 1975 (Act No. II of 1975)\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n49 The words “or to speak on any matter not related to his Ministry” were inserted by section 7 of the Constitution (Twelfth\n\nAmendment) Act, 1991 (Act No. XXVIII of 1991)\n50 The words “Deputy Prime Minister” were omitted by the Constitution (Twelfth Amendment) Act, 1991 (Act XXVIII of\n\n1991), section 7(b).\n51 The words “acting as” were substituted for the words “exercising the functions of the” by section 10 of the Constitution\n\n(Fourth Amendment) Act, 1975 (Act No. II of 1975)\n52 The words “At its first meeting in each session” were omitted by section 11 of the Constitution (Fourth Amendment) Act,\n\n1975 (Act No. II of 1975)\n53 Clause (3) was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 27 (i).\n54 The words “by the votes of a majority of the total number of members of Parliament\" were omitted by the Constitution\n\n(Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 27 (ii).\n55 The words \"in any Money Bill\" were inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 28.\n56 Clause (aa) was omitted by section 8 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n57 Sub-para (ii) was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 29(a).\n58 Para (c) was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 29 (b).\n59 Clause (3) was added by section 9 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n60 Substituted for the words \"Parliament stands dissolved or is not in session\" by the Constitution (Fifteenth Amendment)\n\nAct, 2011 (Act XIV of 2011), section 30.\n61 Substituted for the former Chapter I by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 31.\n62 Clauses (2), (3) and (4) were substituted for the clauses (2), (3), (4), (5), (6), (7) and (8) by section 2 of the Constitution\n\n(Sixteenth Amendment) Act, 2014 (Act No. XIII of 2014).\n63",
    "115": "Article 115 was substituted by section 19 the Constitution (Fourth Amendment) Act, 1975 (Act No. II of 1975)\n64 Substituted for the former article 116 by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 32.\n65",
    "116A": "Article 116A was inserted by section 21 of the Constitution (Fourth Amendment) Act, 1975 (Act No. II of 1975)\n66 Substituted for the former sub-clause (c) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),section\n\n33.\n67 Substituted for the words and commas \"a Chief Election Commissioner and such number of other Election\n\nCommissoners if any, as the President may from time to time direct,\" by the Constitution (Fifteenth amendment) Act, 2011\n(Act XIV of 2011), section 35 (a).\n68 Substituted for the words \"Supreme Court\" by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 35 (b).\n69 Clause (1) was substituted by section 12 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIll of 1991)\n70 The words “to the offices of President and Vice President and” were omitted by section 13 of the Constitution (Twelfth\n\nAmendment) Act, 1991 (Act No. XXVIII of 1991)\n71 Substituted for sub-clauses (c) and (d) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section\n\n36.\n72 Clause (3) was omitted by section 13 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n73 Clauses (1) and (2) were substituted for clauses (1), (2), (2A) and (2B) by section 14 of the Constitution (Twelfth\n\nAmendment) Act, 1991 (Act No. XXVIII of 1991)\n74 Substituted for the former clause (3) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 37.\n75 The colon (:) was substituted for the full stop (.) and thereafter the proviso was added by section 14 of the Constitution\n\n(Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n76",
    "124": "Article 124 was substituted by section 15 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n77 The words “offices of President and Vice President” were substituted for the words “office of President” by section 14 of\n\nthe Constitution (Ninth Amendment) Act. 1989 (Act No. XXXVIII of 1989)\n78 The words “and Vice President” were omitted by section 16 of the Constitution (Twelfth Amendment) Act, 1991 (Act No.\n\nXXVIII of 1991)\n79 Clause (c) was added by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 38.\n80 Clause (1) was substituted by section 5 of the Constitution (Fourteenth Amendment) Act, 2004 (Act No. XIV of 2004)\n81 Substituted for the words \"Supreme Court\" by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 39.\n82 The words “sixty five” were substituted for the words “sixty-two” by section 6 of the Constitution (Fourteenth\n\nAmendment) Act, 2004 (Act No. XIV of 2004)\n83 Substituted for the words “Supreme Court” by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011),\n\nsection 40.\n84 Part IXA was inserted by section 6 of the Constitution (Second Amendment) Act, 1973 (Act No. XXIV of 1973).\n85 The words \" for one hundred twenty days\" were added by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of\n\n2011), section 41 (a).\n86 The proviso was omitted by section 28 of the Constitution (Fourth Amendment) Act, 1975 (Act No. II of 1975)\n87 The proviso was added by section 17 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n88 Omitted by the Constitution (Fifteenth Amendment ) Act, 2011 (Act XIV of 2011), section 41 (b).\n89 Added by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 41 (c).\n90 The words and comma “on the written advice of the Prime Minister, by order” were substituted for the words “by order”\n\nby section 18 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n91",
    "142": "Article 142 was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 42.\n92",
    "145A": "Article 145A was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 43.\n93 Sub clause (aa) was omitted by section 21 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n94 Substituted for the former sub-clause (b) by the Constitution (Fifteenth Amendment) Act, 2011 (Act No. XIV of 2011)\n\nsection 44(i).\n95 Substituted for the former sub-clause (d) by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section\n\n44(ii).\n96 Clause (IA) was omitted by section 22 of the Constitution (Twelfth Amendment) Act, 1991 (Act No. XXVIII of 1991)\n97 The words “and for any reason it is impracticable for the oath to be made before that person” were omitted by section\n\n30 of the Constitution (Fourth Amendment) Act, 1975 (Act No. II of 1975)\n\n25/04/2022\n\nThe Constitution of the People‍’s Republic of Bangladesh\n\n98 Clause (2A) was inserted by section 7 of the Constitution (Fourteenth Amendment) Act, 2004 (Act No. XIV of 2004)\n99",
    "150": "Article 150 was substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 45.\n100 Omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV 2011), section 46 (a).\n101 Substituted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 46(b)\n102 Omitted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 46(d).\n103 Inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 46(b).\n104 Inserted by the Constitution (Fifteenth Amendment) Act, 2011 (Act XIV of 2011), section 46(c).\n105 The semi-colon (;) was substituted for the full stop (.) by section 16 of the Constitution (Ninth Amendment) Act, 1989\n\n(Act No. XXXVIII of 1989)\n106 The expression “the vice president” was omitted by section 23 of the Constitution (Twelfth Amendment) Act, 1991 (Act\n\nNo. XXVIII of 1991)\n\nCopyright © 2019, Legislative and Parliamentary Affairs Division\nMinistry of Law, Justice and Parliamentary Affairs"
  }
}